{
  "details": "\n\nThis is an advance notice that regular security support for Debian\nGNU/Linux 6.0 (code name squeeze) will be terminated on the 31st of\nMay.\n\n\n\n\nHowever, we're happy to announce that security support for squeeze is\ngoing to be extended until February 2016, i.e. five years after the \ninitial release. This effort is driven by various interested parties /\ncompanies which require longer security support. See the LTS section \nof [the initial announcement](https://lists.debian.org/debian-devel-announce/2014/03/msg00004.html).\n\n\n\n\nThe details are currently being sorted out and a more detailed \nannouncement will be made soon.\n\n\n\n\nBrief advance FAQ (but you should really wait for the more detailed \nannouncement):\n\n\n\n\n**What's the difference between regular security support and the LTS \n support?**\nsqueeze-lts is only going to support i386 and amd64. If you're\n running a different architecture you need to upgrade to Debian 7 \n (wheezy). Also there are going to be a few packages which will not\n be supported in squeeze-lts (e.g. a few web-based applications\n which cannot be supported for five years). There will be a tool to \n detect such unsupported packages.\n**Does this mean that Debian 7 (wheezy) and/or Debian 8 (jessie) will \n have five years security support as well?**\nLikely, we'll see how squeeze-lts turns out. If there's sufficient \n support it will be continued for later releases as well. Also, see \n below.\n**Is additional help needed?**\nAbsolutely. squeeze-lts is not handled by the Debian security team, \n but by a separate group of volunteers and companies interested in \n making it a success (with some overlap in people involved). So, if\n you're a company using Debian and seeing a benefit in security \n support for five years, get in touch with team@security.debian.org\n and we'll see how you can help (if you e.g. don't have the manpower /\n know how but are willing to contribute, we can point you to a list\n of Debian consultants)\n\n",
  "id": "DSA-2907-1",
  "modified": "2022-07-04T02:00:51.077026Z",
  "published": "2014-04-16T00:00:00Z",
  "schema_version": "1.6.0",
  "summary": "squeeze end-of-life",
  "withdrawn": "2024-05-15T05:36:14.058177Z"
}