{
  "details": "\nThe initial organisation and setup of Squeeze LTS has now happened and it is \nready for taking over security support once the standard security support ends \nat the end of the month:\n\n\n### Information for users\n\n\nSupport for Squeeze LTS will end five years after the release of Squeeze, \ni.e. until the 6th of February 2016.\n\n\nYou need to enable the apt sources for squeeze-lts manually. \nInformation on how to do this can be found at \n\n\n\nYou should also subscribe to the new annoucement mailing list for security \nupdates for squeeze-lts:\n\n\n\nA few packages are not covered by the Squeeze LTS support. These can be\ndetected with the new tool `debian-security-support`. Information on \nhow to run it can be found here:\n\n\n\nIf `debian-security-support` detects an unsupported package which \nis critical to you, please get in touch with \n[debian-lts@lists.debian.org](mailto:debian-lts@lists.debian.org) \n(see below).\n\n\nsqueeze-backports will continue to be supported for the lifetime of \nSqueeze LTS.\n\n\n### Information for Debian maintainers\n\n\nFirst of all, Debian package maintainers are not expected to work on updates \nof their packages for squeeze-lts. Package updates for squeeze-lts \nwill be handled by the Debian LTS team.\n\n\nHowever, if you *are* interested in doing so (and the maintainer always\nknows best on a package), you're certainly welcome to do so; everyone in the \nDebian.org and Debian maintainers key ring can upload to the squeeze-lts \nsuite. Information on how to upload a fixed package can be found at \n\n\n\n### Mailing lists\n\n\nThe whole coordination of the Debian LTS effort is handled through the\ndebian-lts mailing list: \n\n\nPlease subscribe or follow us via GMANE (gmane.linux.debian.devel.lts)\n\n\nAside from the debian-lts-announce list, there's also a list for \nfollowing all uploads in debian-lts: \n\n\n\n### Security Tracker\n\n\nAll information on the status of vulnerabilities (e.g. if the version in \nsqueeze-lts happens to be unaffected while wheezy is affected) will be \ntracked in the Debian Security Tracker:\n\n\n\nIf you happen to spot an error in the data, please see \n\n\n\n",
  "id": "DSA-2938-1",
  "modified": "2022-07-04T02:00:57.990162Z",
  "published": "2014-05-27T00:00:00Z",
  "schema_version": "1.7.3",
  "summary": "squeeze-lts announcement",
  "withdrawn": "2024-05-15T05:36:14.078147Z"
}