{
  "affected": [
    {
      "database_specific": {
        "source": "https://advisories.mageia.org/MGASA-2024-0095.json"
      },
      "ecosystem_specific": {
        "section": "core"
      },
      "package": {
        "ecosystem": "Mageia:9",
        "name": "grub2",
        "purl": "pkg:rpm/mageia/grub2?arch=source&distro=mageia-9"
      },
      "ranges": [
        {
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "2.06-28.2.mga9"
            }
          ],
          "type": "ECOSYSTEM"
        }
      ],
      "versions": []
    }
  ],
  "credits": [
    {
      "contact": [
        "https://wiki.mageia.org/en/Packages_Security_Team"
      ],
      "name": "Mageia",
      "type": "COORDINATOR"
    }
  ],
  "details": "An out-of-bounds write flaw was found in grub2's NTFS filesystem driver.\nThis issue may allow an attacker to present a specially crafted NTFS\nfilesystem image, leading to grub's heap metadata corruption. In some\ncircumstances, the attack may also corrupt the UEFI firmware heap\nmetadata. As a result, arbitrary code execution and secure boot\nprotection bypass may be achieved. (CVE-2023-4692)\nAn out-of-bounds read flaw was found on grub2's NTFS filesystem driver.\nThis issue may allow a physically present attacker to present a\nspecially crafted NTFS file system image to read arbitrary memory\nlocations. A successful attack allows sensitive data cached in memory or\nEFI variable values to be leaked, presenting a high Confidentiality\nrisk. (CVE-2023-4693)\nAn authentication bypass flaw was found in GRUB due to the way that GRUB\nuses the UUID of a device to search for the configuration file that\ncontains the password hash for the GRUB password protection feature. An\nattacker capable of attaching an external drive such as a USB stick\ncontaining a file system with a duplicate UUID (the same as in the\n\"/boot/\" file system) can bypass the GRUB password protection feature on\nUEFI systems, which enumerate removable drives before non-removable\nones. (CVE-2023-4001)\nA flaw was found in the grub2-set-bootflag utility of grub2. After the\nfix of CVE-2019-14865, grub2-set-bootflag will create a temporary file\nwith the new grubenv content and rename it to the original grubenv file.\nIf the program is killed before the rename operation, the temporary file\nwill not be removed and may fill the filesystem when invoked multiple\ntimes, resulting in a filesystem out of free inodes or blocks.\n(CVE-2024-1048)\n",
  "id": "MGASA-2024-0095",
  "modified": "2024-03-28T03:36:32Z",
  "published": "2024-03-28T03:52:55Z",
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://advisories.mageia.org/MGASA-2024-0095.html"
    },
    {
      "type": "REPORT",
      "url": "https://bugs.mageia.org/show_bug.cgi?id=32997"
    },
    {
      "type": "REPORT",
      "url": "https://lists.fedoraproject.org/archives/list/package-announce@lists.fedoraproject.org/message/YSJAEGRR3XHMBBBKYOVMII4P34IXEYPE/"
    }
  ],
  "related": [
    "CVE-2023-4001",
    "CVE-2023-4692",
    "CVE-2023-4693",
    "CVE-2024-1048"
  ],
  "schema_version": "1.6.0",
  "summary": "Updated grub2 packages fix security vulnerabilities"
}