{
  "id": "MGASA-2015-0342",
  "summary": "Updated iceape packages fix security vulnerabilities",
  "details": "Updated iceape packages fix security issues:\n\nMultiple unspecified vulnerabilities in the browser engine in Mozilla Firefox \nbefore 37.0, Firefox ESR 31.x before 31.6, and Thunderbird before 31.6 allow \nremote attackers to cause a denial of service (memory corruption and application \ncrash) or possibly execute arbitrary code via unknown vectors. (CVE-2015-0814, \nCVE-2015-0815)\n\nUse-after-free vulnerability in the AppendElements function in Mozilla Firefox \nbefore 37.0, Firefox ESR 31.x before 31.6, and Thunderbird before 31.6 on Linux, \nwhen the Fluendo MP3 plugin for GStreamer is used, allows remote attackers to \nexecute arbitrary code or cause a denial of service (heap memory corruption) via \na crafted MP3 file. (CVE-2015-0813)\n\nMozilla Firefox before 37.0 does not require an HTTPS session for lightweight \ntheme add-on installations, which allows man-in-the-middle attackers to bypass \nan intended user-confirmation requirement by deploying a crafted web site and \nconducting a DNS spoofing attack against a mozilla.org subdomain. \n(CVE-2015-0812)\n\nMozilla Firefox before 37.0, Firefox ESR 31.x before 31.6, and Thunderbird \nbefore 31.6 do not properly restrict resource: URLs, which makes it easier for \nremote attackers to execute arbitrary JavaScript code with chrome privileges by \nleveraging the ability to bypass the Same Origin Policy, as demonstrated by the \nresource: URL associated with PDF.js. (CVE-2015-0816)\n\nThe QCMS implementation in Mozilla Firefox before 37.0 allows remote attackers \nto obtain sensitive information from process heap memory or cause a denial of \nservice (out-of-bounds read) via an image that is improperly handled during \ntransformation. (CVE-2015-0811)\n\nThe webrtc::VPMContentAnalysis::Release function in the WebRTC implementation in \nMozilla Firefox before 37.0 uses incompatible approaches to the deallocation of \nmemory for simple-type arrays, which might allow remote attackers to cause a \ndenial of service (memory corruption) via unspecified vectors. (CVE-2015-0808)\n\nThe navigator.sendBeacon implementation in Mozilla Firefox before 37.0, Firefox \nESR 31.x before 31.6, and Thunderbird before 31.6 processes HTTP 30x status \ncodes for redirects after a preflight request has occurred, which allows remote \nattackers to bypass intended CORS access-control checks and conduct cross-site \nrequest forgery (CSRF) attacks via a crafted web site, a similar issue to \nCVE-2014-8638. (CVE-2015-0807)\n\nThe Off Main Thread Compositing (OMTC) implementation in Mozilla Firefox before \n37.0 makes an incorrect memset call during interaction with the \nmozilla::layers::BufferTextureClient::AllocateForSurface function, which allows \nremote attackers to execute arbitrary code or cause a denial of service (memory \ncorruption and application crash) via vectors that trigger rendering of 2D \ngraphics content. (CVE-2015-0805)\n\nThe Off Main Thread Compositing (OMTC) implementation in Mozilla Firefox before \n37.0 attempts to use memset for a memory region of negative length during \ninteraction with the mozilla::layers::BufferTextureClient::AllocateForSurface \nfunction, which allows remote attackers to execute arbitrary code or cause a \ndenial of service (memory corruption) via vectors that trigger rendering of 2D \ngraphics content. (CVE-2015-0806)\n\nThe HTMLSourceElement::AfterSetAttr function in Mozilla Firefox before 37.0 does \nnot properly constrain the original data type of a casted value during the \nsetting of a SOURCE element's attributes, which allows remote attackers to \nexecute arbitrary code or cause a denial of service (use-after-free) via a \ncrafted HTML document. (CVE-2015-0803)\n\nThe HTMLSourceElement::BindToTree function in Mozilla Firefox before 37.0 does \nnot properly constrain a data type after omitting namespace validation during \ncertain tree-binding operations, which allows remote attackers to execute \narbitrary code or cause a denial of service (use-after-free) via a crafted HTML \ndocument containing a SOURCE element. (CVE-2015-0804)\n\nMozilla Firefox before 37.0, Firefox ESR 31.x before 31.6, and Thunderbird \nbefore 31.6 allow remote attackers to bypass the Same Origin Policy and execute \narbitrary JavaScript code with chrome privileges via vectors involving anchor \nnavigation, a similar issue to CVE-2015-0818. (CVE-2015-0801)\n\nMozilla Firefox before 37.0 relies on docshell type information instead of page \nprincipal information for Window.webidl access control, which might allow remote \nattackers to execute arbitrary JavaScript code with chrome privileges via \ncertain content navigation that leverages the reachability of a privileged \nwindow with an unintended persistence of access to restricted internal methods. \n(CVE-2015-0802)\n\nThe HTTP Alternative Services feature in Mozilla Firefox before 37.0.1 allows \nman-in-the-middle attackers to bypass an intended X.509 certificate-verification \nstep for an SSL server by specifying that server in the uri-host field of an \nAlt-Svc HTTP/2 response header. (CVE-2015-0799)\n\nRace condition in the AsyncPaintWaitEvent::AsyncPaintWaitEvent function in \nMozilla Firefox before 37.0.2 allows remote attackers to execute arbitrary code \nor cause a denial of service (use-after-free) via a crafted plugin that does not \nproperly complete initialization. (CVE-2015-2706)\n\nMultiple unspecified vulnerabilities in the browser engine in Mozilla Firefox \nbefore 38.0, Firefox ESR 31.x before 31.7, and Thunderbird before 31.7 allow \nremote attackers to cause a denial of service (memory corruption and application \ncrash) or possibly execute arbitrary code via unknown vectors. (CVE-2015-2708)\n\nMultiple unspecified vulnerabilities in the browser engine in Mozilla Firefox \nbefore 38.0 allow remote attackers to cause a denial of service (memory \ncorruption and application crash) or possibly execute arbitrary code via unknown \nvectors. (CVE-2015-2709)\n\nHeap-based buffer overflow in the SVGTextFrame class in Mozilla Firefox before \n38.0, Firefox ESR 31.x before 31.7, and Thunderbird before 31.7 allows remote \nattackers to execute arbitrary code via crafted SVG graphics data in conjunction \nwith a crafted Cascading Style Sheets (CSS) token sequence. (CVE-2015-2710)\n\nMozilla Firefox before 38.0 does not recognize a referrer policy delivered by a \nreferrer META element in cases of context-menu navigation and middle-click \nnavigation, which allows remote attackers to obtain sensitive information by \nreading web-server Referer logs that contain private data in a URL, as \ndemonstrated by a private path component. (CVE-2015-2711)\n\nThe asm.js implementation in Mozilla Firefox before 38.0 does not properly \ndetermine heap lengths during identification of cases in which bounds checking \nmay be safely skipped, which allows remote attackers to trigger out-of-bounds \nwrite operations and possibly execute arbitrary code, or trigger out-of-bounds \nread operations and possibly obtain sensitive information from process memory, \nvia crafted JavaScript. (CVE-2015-2712)\n\nUse-after-free vulnerability in the SetBreaks function in Mozilla Firefox before \n38.0, Firefox ESR 31.x before 31.7, and Thunderbird before 31.7 allows remote \nattackers to execute arbitrary code or cause a denial of service (heap memory \ncorruption) via a document containing crafted text in conjunction with a \nCascading Style Sheets (CSS) token sequence containing properties related to \nvertical text. (CVE-2015-2713)\n\nRace condition in the nsThreadManager::RegisterCurrentThread function in Mozilla \nFirefox before 38.0 allows remote attackers to execute arbitrary code or cause a \ndenial of service (use-after-free and heap memory corruption) by leveraging \nimproper Media Decoder Thread creation at the time of a shutdown. \n(CVE-2015-2715)\n\nBuffer overflow in the XML parser in Mozilla Firefox before 38.0, Firefox ESR \n31.x before 31.7, and Thunderbird before 31.7 allows remote attackers to execute \narbitrary code by providing a large amount of compressed XML data. \n(CVE-2015-2716)\n\nInteger overflow in libstagefright in Mozilla Firefox before 38.0 allows remote \nattackers to execute arbitrary code or cause a denial of service (heap-based \nbuffer overflow and out-of-bounds read) via an MP4 video file containing invalid \nmetadata. (CVE-2015-2717)\n\nThe WebChannel.jsm module in Mozilla Firefox before 38.0 allows remote attackers \nto bypass the Same Origin Policy and obtain sensitive webchannel-response data \nvia a crafted web site containing an IFRAME element referencing a different web \nsite that is intended to read this data. (CVE-2015-2718)\n\nMultiple integer overflows in libstagefright in Mozilla Firefox before 38.0 \nallow remote attackers to execute arbitrary code via crafted sample metadata in \nan MPEG-4 video file. (CVE-2015-4496)\n",
  "modified": "2015-09-08T07:04:22Z",
  "published": "2015-09-08T07:20:40Z",
  "related": [
    "CVE-2015-0799",
    "CVE-2015-0801",
    "CVE-2015-0802",
    "CVE-2015-0803",
    "CVE-2015-0804",
    "CVE-2015-0805",
    "CVE-2015-0806",
    "CVE-2015-0807",
    "CVE-2015-0808",
    "CVE-2015-0811",
    "CVE-2015-0812",
    "CVE-2015-0813",
    "CVE-2015-0814",
    "CVE-2015-0815",
    "CVE-2015-0816",
    "CVE-2015-2706",
    "CVE-2015-2708",
    "CVE-2015-2709",
    "CVE-2015-2710",
    "CVE-2015-2711",
    "CVE-2015-2712",
    "CVE-2015-2713",
    "CVE-2015-2715",
    "CVE-2015-2716",
    "CVE-2015-2717",
    "CVE-2015-2718",
    "CVE-2015-4496"
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://advisories.mageia.org/MGASA-2015-0342.html"
    },
    {
      "type": "REPORT",
      "url": "https://bugs.mageia.org/show_bug.cgi?id=16698"
    },
    {
      "type": "REPORT",
      "url": "http://www.seamonkey-project.org/releases/seamonkey2.35/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-30/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-31/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-32/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-33/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-34/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-36/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-37/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-38/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-39/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-40/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-42/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-44/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-45/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-46/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-48/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-49/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-50/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-51/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-53/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-54/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-55/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-56/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2015-93/"
    }
  ],
  "affected": [
    {
      "package": {
        "name": "iceape",
        "ecosystem": "Mageia:4",
        "purl": "pkg:rpm/mageia/iceape?arch=source&distro=mageia-4"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "2.35-1.mga4"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "section": "core"
      },
      "database_specific": {
        "source": "https://advisories.mageia.org/MGASA-2015-0342.json"
      },
      "versions": []
    },
    {
      "package": {
        "name": "iceape",
        "ecosystem": "Mageia:5",
        "purl": "pkg:rpm/mageia/iceape?arch=source&distro=mageia-5"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "2.35-1.mga5"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "section": "core"
      },
      "database_specific": {
        "source": "https://advisories.mageia.org/MGASA-2015-0342.json"
      },
      "versions": []
    }
  ],
  "schema_version": "1.6.0",
  "credits": [
    {
      "name": "Mageia",
      "contact": [
        "https://wiki.mageia.org/en/Packages_Security_Team"
      ],
      "type": "COORDINATOR"
    }
  ]
}