{
  "id": "MGASA-2014-0518",
  "summary": "Updated iceape package fixes security vulnerabilities",
  "details": "When the oxygen-gtk was active and iceape tried to draw a menu (for \nexample after a mouse down event on the menu bar), a segmentation \nfault was triggered causing iceape to crash. The oxygen-gtk theme \nengine contains a solution for this problem, this is now enabled for \niceape. (MGA #12978)\n\nMozilla developers and community identified and fixed several memory \nsafety bugs in the browser engine used in Firefox and other \nMozilla-based products. Some of these bugs showed evidence of memory \ncorruption under certain circumstances, and we presume that with \nenough effort at least some of these could be exploited to run \narbitrary code. (CVE-2014-1587, CVE-2014-1588)\n\nA method was found to trigger chrome level XML Binding Language (XBL) \nbindings through web content. This was possible because some chrome \naccessible CSS stylesheets had their primary namespace improperly \ndeclared. When this occurred, it was possible to use these stylesheets \nto manipulate XBL bindings, allowing web content to bypass security \nrestrictions. This issue was limited to a specific set of stylesheets. \n(CVE-2014-1589)\n\nIn Iceape (seamonkey) before version 2.31, passing a JavaScript object \nto XMLHttpRequest that mimics an input stream will result in a crash. \nThis crash is not exploitable and can only be used for denial of \nservice attacks. (CVE-2014-1590)\n\nContent Security Policy (CSP) violation reports triggered by a \nredirect did not remove path information as required by the CSP \nspecification in Iceape (seamonkey) 2.30. This potentially reveals \ninformation about the redirect that would not otherwise be known to \nthe original site. This could be used by a malicious site to obtain \nsensitive information such as usernames or single-sign-on tokens \nencoded within the target URLs. (CVE-2014-1591)\n\nIn Iceape (seamonkey) before version 2.31, a use-after-free could be \ncreated by triggering the creation of a second root element while \nparsing HTML written to a document created with document.open(). This \nleads to a potentially exploitable crash. (CVE-2014-1592)\n\nA buffer overflow during the parsing of media content was found using \nthe Address Sanitizer tool. This leads to a potentially exploitable \ncrash. (CVE-2014-1593)\n\nA bad casting from the BasicThebesLayer to BasicContainerLayer \nresulted in undefined behavior. This behavior is potentially \nexploitable with some compilers but no clear mechanism to trigger it \nthrough web content was identified. (CVE-2014-1594)\n\nWhen chrome objects are protected by Chrome Object Wrappers (COW) and \nare passed as native interfaces, if this is done with some methods, \nnormally protected objects may be accessible to native methods exposed \nto web content. (CVE-2014-8631)\n\nWhen XrayWrappers filter object properties and validation of the \nobject initially occurs, one set of object properties will appear to \nbe available. Later, when the XrayWrappers are removed, a more \nexpansive set of properties is available. These are then stored \nwithout further validation, making these properties available and \nbypassing security protections that would normally protect them from \naccess. (CVE-2014-8632)\n",
  "modified": "2014-12-09T20:03:54Z",
  "published": "2014-12-09T20:12:41Z",
  "related": [
    "CVE-2014-1587",
    "CVE-2014-1588",
    "CVE-2014-1589",
    "CVE-2014-1590",
    "CVE-2014-1591",
    "CVE-2014-1592",
    "CVE-2014-1593",
    "CVE-2014-1594",
    "CVE-2014-8631",
    "CVE-2014-8632"
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://advisories.mageia.org/MGASA-2014-0518.html"
    },
    {
      "type": "REPORT",
      "url": "https://bugs.mageia.org/show_bug.cgi?id=14733"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2014-83/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2014-84/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2014-85/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2014-86/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2014-87/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2014-88/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2014-89/"
    },
    {
      "type": "REPORT",
      "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2014-91/"
    },
    {
      "type": "REPORT",
      "url": "https://bugs.mageia.org/show_bug.cgi?id=12978"
    }
  ],
  "affected": [
    {
      "package": {
        "name": "iceape",
        "ecosystem": "Mageia:4",
        "purl": "pkg:rpm/mageia/iceape?arch=source&distro=mageia-4"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "2.31-3.mga4"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "section": "core"
      },
      "database_specific": {
        "source": "https://advisories.mageia.org/MGASA-2014-0518.json"
      },
      "versions": []
    }
  ],
  "schema_version": "1.6.0",
  "credits": [
    {
      "name": "Mageia",
      "contact": [
        "https://wiki.mageia.org/en/Packages_Security_Team"
      ],
      "type": "COORDINATOR"
    }
  ]
}