{
  "affected": [
    {
      "database_specific": {
        "source": "https://advisories.mageia.org/MGASA-2024-0333.json"
      },
      "ecosystem_specific": {
        "section": "core"
      },
      "package": {
        "ecosystem": "Mageia:9",
        "name": "unbound",
        "purl": "pkg:rpm/mageia/unbound?arch=source&distro=mageia-9"
      },
      "ranges": [
        {
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "1.21.1-1.mga9"
            }
          ],
          "type": "ECOSYSTEM"
        }
      ],
      "versions": []
    }
  ],
  "credits": [
    {
      "contact": [
        "https://wiki.mageia.org/en/Packages_Security_Team"
      ],
      "name": "Mageia",
      "type": "COORDINATOR"
    }
  ],
  "details": "NLnet Labs Unbound up to and including version 1.21.0 contains a\nvulnerability when handling replies with very large RRsets that it needs\nto perform name compression for. Malicious upstreams responses with very\nlarge RRsets can cause Unbound to spend a considerable time applying\nname compression to downstream replies. This can lead to degraded\nperformance and eventually denial of service in well orchestrated\nattacks. The vulnerability can be exploited by a malicious actor\nquerying Unbound for the specially crafted contents of a malicious zone\nwith very large RRsets. Before Unbound replies to the query it will try\nto apply name compression which was an unbounded operation that could\nlock the CPU until the whole packet was complete. Unbound version 1.21.1\nintroduces a hard limit on the number of name compression calculations\nit is willing to do per packet. Packets that need more compression will\nresult in semi-compressed packets or truncated packets, even on TCP for\nhuge messages, to avoid locking the CPU for long. This change should not\naffect normal DNS traffic.\n",
  "id": "MGASA-2024-0333",
  "modified": "2024-10-16T01:07:03Z",
  "published": "2024-10-16T01:32:06Z",
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://advisories.mageia.org/MGASA-2024-0333.html"
    },
    {
      "type": "REPORT",
      "url": "https://bugs.mageia.org/show_bug.cgi?id=33621"
    }
  ],
  "related": [
    "CVE-2024-8508"
  ],
  "schema_version": "1.7.0",
  "summary": "Updated unbound packages fix security vulnerabilities"
}