{"schema_version":"1.7.3","id":"OESA-2025-2840","published":"2025-12-12T12:21:07Z","modified":"2025-12-12T12:44:50.956985Z","upstream":["CVE-2025-21605","CVE-2025-32023","CVE-2025-46817","CVE-2025-46818","CVE-2025-46819","CVE-2025-48367","CVE-2025-49844"],"summary":"redis6 security update","details":"Redis is an advanced key-value store. It is often referred to as a data structure server since keys can contain strings, hashes, lists, sets and sorted sets. You can run atomic operations on these types, like appending to a string; incrementing the value in a hash; pushing to a list; computing set intersection, union and difference; or getting the member with highest ranking in a sorted set. In order to achieve its outstanding performance, Redis works with an in-memory dataset. Depending on your use case, you can persist it either by dumping the dataset to disk every once in a while, or by appending each command to a log. Redis also supports trivial-to-setup master-slave replication, with very fast non-blocking first synchronization, auto-reconnection on net split and so forth. Other features include Transactions, Pub/Sub, Lua scripting, Keys with a limited time-to-live, and configuration settings to make Redis behave like a cache. You can use Redis from most programming languages also.\r\n\r\nSecurity Fix(es):\n\nRedis is an open source, in-memory database that persists on disk. In versions starting at 2.6 and prior to 7.4.3, An unauthenticated client can cause unlimited growth of output buffers, until the server runs out of memory or is killed. By default, the Redis configuration does not limit the output buffer of normal clients (see client-output-buffer-limit). Therefore, the output buffer can grow unlimitedly over time. As a result, the service is exhausted and the memory is unavailable. When password authentication is enabled on the Redis server, but no password is provided, the client can still cause the output buffer to grow from &quot;NOAUTH&quot; responses until the system will run out of memory. This issue has been patched in version 7.4.3. An additional workaround to mitigate this problem without patching the redis-server executable is to block access to prevent unauthenticated users from connecting to Redis. This can be done in different ways. Either using network access control tools like firewalls, iptables, security groups, etc, or enabling TLS and requiring users to authenticate using client side certificates.(CVE-2025-21605)\n\nRedis is an open source, in-memory database that persists on disk. From version 2.8 to before 8.0.3, 7.4.5, 7.2.10, and 6.2.19, an authenticated user may use a specially crafted string to trigger a stack/heap out of bounds write on hyperloglog operations, potentially leading to remote code execution. The bug likely affects all Redis versions with hyperloglog operations implemented. This vulnerability is fixed in 8.0.3, 7.4.5, 7.2.10, and 6.2.19.(CVE-2025-32023)\n\nRedis is an open source, in-memory database that persists on disk. Versions 8.2.1 and below allow an authenticated user to use a specially crafted Lua script to cause an integer overflow and potentially lead to remote code execution. The problem exists in all versions of Redis with Lua scripting. This issue is fixed in version 8.2.2.(CVE-2025-46817)\n\nRedis is an open source, in-memory database that persists on disk. Versions 8.2.1 and below allow an authenticated user to use a specially crafted Lua script to manipulate different LUA objects and potentially run their own code in the context of another user. The problem exists in all versions of Redis with LUA scripting. This issue is fixed in version 8.2.2. A workaround to mitigate the problem without patching the redis-server executable is to prevent users from executing LUA scripts. This can be done using ACL to block a script by restricting both the EVAL and FUNCTION command families.(CVE-2025-46818)\n\nRedis is an open source, in-memory database that persists on disk. Versions 8.2.1 and below allow an authenticated user to use a specially crafted LUA script to read out-of-bound data or crash the server and subsequent denial of service. The problem exists in all versions of Redis with Lua scripting.(CVE-2025-46819)\n\nRedis is an open source, in-memory database that persists on disk. An unauthenticated connection can cause repeated IP protocol errors, leading to client starvation and, ultimately, a denial of service. This vulnerability is fixed in 8.0.3, 7.4.5, 7.2.10, and 6.2.19.(CVE-2025-48367)\n\nAn authenticated user may use a specially crafted Lua script to manipulate the garbage collector, trigger a use-after-free and potentially lead to remote code execution. The problem exists in all versions of Redis with Lua scripting.(CVE-2025-49844)","affected":[{"package":{"name":"redis6","ecosystem":"openEuler:22.03-LTS-SP4","purl":"pkg:rpm/openEuler/redis6&distro=openEuler-22.03-LTS-SP4"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"6.2.7-6.oe2203sp4"}]}],"ecosystem_specific":{"aarch64":["redis6-6.2.7-6.oe2203sp4.aarch64.rpm","redis6-debuginfo-6.2.7-6.oe2203sp4.aarch64.rpm","redis6-debugsource-6.2.7-6.oe2203sp4.aarch64.rpm","redis6-devel-6.2.7-6.oe2203sp4.aarch64.rpm"],"noarch":["redis6-doc-6.2.7-6.oe2203sp4.noarch.rpm"],"src":["redis6-6.2.7-6.oe2203sp4.src.rpm"],"x86_64":["redis6-6.2.7-6.oe2203sp4.x86_64.rpm","redis6-debuginfo-6.2.7-6.oe2203sp4.x86_64.rpm","redis6-debugsource-6.2.7-6.oe2203sp4.x86_64.rpm","redis6-devel-6.2.7-6.oe2203sp4.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2025-2840.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/zh/security/security-bulletins/detail/?id=openEuler-SA-2025-2840"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-21605"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-32023"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-46817"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-46818"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-46819"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-48367"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-49844"}],"database_specific":{"severity":"Critical"}}