{"schema_version":"1.7.3","id":"OESA-2021-1077","published":"2021-03-05T11:02:41Z","modified":"2025-09-03T06:17:18.510267Z","upstream":["CVE-2021-23926"],"summary":"xmlbeans security update","details":"XMLBeans is a tool that allows you to access the full power of XML in a Java friendly way. It is an XML-Java binding tool. The idea is that you can take advantage the richness and features of XML and XML Schema and have these features mapped as naturally as possible to the equivalent Java language and typing constructs. XMLBeans uses XML Schema to compile Java interfaces and classes that you can then use to access and modify XML instance data. Using XMLBeans is similar to using any other Java interface/class, you will see things like getFoo or setFoo just as you would expect when working with Java. While a major use of XMLBeans is to access your XML instance data with strongly typed Java classes there are also API's that allow you access to the full XML infoset (XMLBeans keeps full XML Infoset fidelity) as well as to allow you to reflect into the XML schema itself through an XML Schema Object model.\r\n\r\nSecurity Fix(es):\r\n\r\nThe XML parsers used by XMLBeans up to version 2.6.0 did not set the properties needed to protect the user from malicious XML input. Vulnerabilities include possibilities for XML Entity Expansion attacks. Affects XMLBeans up to and including v2.6.0.(CVE-2021-23926)","affected":[{"package":{"name":"xmlbeans","ecosystem":"openEuler:20.03-LTS-SP1","purl":"pkg:rpm/openEuler/xmlbeans&distro=openEuler-20.03-LTS-SP1"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"2.6.0-2.oe1"}]}],"ecosystem_specific":{"noarch":["xmlbeans-2.6.0-2.oe1.noarch.rpm","xmlbeans-scripts-2.6.0-2.oe1.noarch.rpm","xmlbeans-javadoc-2.6.0-2.oe1.noarch.rpm","xmlbeans-manual-2.6.0-2.oe1.noarch.rpm"],"src":["xmlbeans-2.6.0-2.oe1.src.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2021-1077.json"}}],"references":[{"type":"ADVISORY","url":"https://openeuler.org/en/security/safety-bulletin/detail.html?id=openEuler-SA-2021-1077"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23926"}],"database_specific":{"severity":"Critical"}}