{"schema_version":"1.7.3","id":"OESA-2026-1131","published":"2026-01-16T12:00:03Z","modified":"2026-01-16T12:30:17.433538Z","upstream":["CVE-2025-2153","CVE-2025-2310","CVE-2025-2912","CVE-2025-2913","CVE-2025-2914","CVE-2025-2923","CVE-2025-2924","CVE-2025-2925","CVE-2025-2926","CVE-2025-44905","CVE-2025-6269","CVE-2025-6516","CVE-2025-6750","CVE-2025-6816","CVE-2025-6818","CVE-2025-6856","CVE-2025-6857","CVE-2025-6858","CVE-2025-7067","CVE-2025-7068"],"summary":"hdf5 security update","details":"HDF5 is a data model, library, and file format for storing and managing data. It supports an unlimited variety of datatypes, and is designed for flexible and efficient I/O and for high volume and complex data. HDF5 is portable and is extensible, allowing applications to evolve in their use of HDF5. The HDF5 Technology suite includes tools and applications for managing, manipulating, viewing, and analyzing data in the HDF5 format.\r\n\r\nSecurity Fix(es):\n\nA vulnerability, which was classified as critical, was found in HDF5 1.14.6. Affected is the function H5SM_delete of the file H5SM.c of the component h5 File Handler. The manipulation leads to heap-based buffer overflow. It is possible to launch the attack remotely. The complexity of an attack is rather high. The exploitability is told to be difficult. The exploit has been disclosed to the public and may be used.(CVE-2025-2153)\n\nA vulnerability was found in HDF5 1.14.6 and classified as critical. This issue affects the function H5MM_strndup of the component Metadata Attribute Decoder. The manipulation leads to heap-based buffer overflow. Attacking locally is a requirement. The exploit has been disclosed to the public and may be used. The vendor plans to fix this issue in an upcoming release.(CVE-2025-2310)\n\nA vulnerability was found in HDF5 up to 1.14.6. It has been declared as problematic. Affected by this vulnerability is the function H5O_msg_flush of the file src/H5Omessage.c. The manipulation of the argument oh leads to heap-based buffer overflow. The attack needs to be approached locally. The exploit has been disclosed to the public and may be used.(CVE-2025-2912)\n\nA vulnerability was found in HDF5 up to 1.14.6. It has been rated as critical. Affected by this issue is the function H5FL__blk_gc_list of the file src/H5FL.c. The manipulation of the argument H5FL_blk_head_t leads to use after free. An attack has to be approached locally. The exploit has been disclosed to the public and may be used.(CVE-2025-2913)\n\nA vulnerability classified as problematic has been found in HDF5 up to 1.14.6. This affects the function H5FS__sinfo_Srialize_Sct_cb of the file src/H5FScache.c. The manipulation of the argument sect leads to heap-based buffer overflow. Local access is required to approach this attack. The exploit has been disclosed to the public and may be used.(CVE-2025-2914)\n\nA vulnerability, which was classified as problematic, has been found in HDF5 up to 1.14.6. Affected by this issue is the function H5F_addr_encode_len of the file src/H5Fint.c. The manipulation of the argument pp leads to heap-based buffer overflow. Attacking locally is a requirement. The exploit has been disclosed to the public and may be used.(CVE-2025-2923)\n\nA vulnerability, which was classified as problematic, was found in HDF5 up to 1.14.6. This affects the function H5HL__fl_deserialize of the file src/H5HLcache.c. The manipulation of the argument free_block leads to heap-based buffer overflow. It is possible to launch the attack on the local host. The exploit has been disclosed to the public and may be used.(CVE-2025-2924)\n\nA vulnerability has been found in HDF5 up to 1.14.6 and classified as problematic. This vulnerability affects the function H5MM_realloc of the file src/H5MM.c. The manipulation of the argument mem leads to double free. The attack needs to be approached locally. The exploit has been disclosed to the public and may be used.(CVE-2025-2925)\n\nA vulnerability was found in HDF5 up to 1.14.6 and classified as problematic. This issue affects the function H5O__cache_chk_serialize of the file src/H5Ocache.c. The manipulation leads to null pointer dereference. An attack has to be approached locally. The exploit has been disclosed to the public and may be used.(CVE-2025-2926)\n\nhdf5 v1.14.6 was discovered to contain a heap buffer overflow via the H5Z__filter_scaleoffset function.(CVE-2025-44905)\n\nA vulnerability classified as critical was found in HDF5 up to 1.14.6. Affected by this vulnerability is the function H5C__reconstruct_cache_entry of the file H5Cimage.c. The manipulation leads to heap-based buffer overflow. Attacking locally is a requirement. The exploit has been disclosed to the public and may be used.(CVE-2025-6269)\n\nA vulnerability has been found in HDF5 up to 1.14.6 and classified as critical. This vulnerability affects the function H5F_addr_decode_len of the file /hdf5/src/H5Fint.c. The manipulation leads to heap-based buffer overflow. An attack has to be approached locally. The exploit has been disclosed to the public and may be used.(CVE-2025-6516)\n\nA vulnerability, which was classified as problematic, has been found in HDF5 1.14.6. Affected by this issue is the function H5O__mtime_new_encode of the file src/H5Omtime.c. The manipulation leads to heap-based buffer overflow. Attacking locally is a requirement. The exploit has been disclosed to the public and may be used.(CVE-2025-6750)\n\nA vulnerability classified as problematic was found in HDF5 1.14.6. This vulnerability affects the function H5O__fsinfo_encode of the file /src/H5Ofsinfo.c. The manipulation leads to heap-based buffer overflow. It is possible to launch the attack on the local host. The exploit has been disclosed to the public and may be used.(CVE-2025-6816)\n\nA vulnerability, which was classified as problematic, was found in HDF5 1.14.6. Affected is the function H5O__chunk_protect of the file /src/H5Ochunk.c. The manipulation leads to heap-based buffer overflow. An attack has to be approached locally. The exploit has been disclosed to the public and may be used.(CVE-2025-6818)\n\nA vulnerability, which was classified as problematic, was found in HDF5 1.14.6. Affected is the function H5FL__reg_gc_list of the file src/H5FL.c. The manipulation leads to use after free. Attacking locally is a requirement. The exploit has been disclosed to the public and may be used.(CVE-2025-6856)\n\nA vulnerability has been found in HDF5 1.14.6 and classified as problematic. Affected by this vulnerability is the function H5G__node_cmp3 of the file src/H5Gnode.c. The manipulation leads to stack-based buffer overflow. It is possible to launch the attack on the local host. The exploit has been disclosed to the public and may be used.(CVE-2025-6857)\n\nA vulnerability was found in HDF5 1.14.6 and classified as problematic. Affected by this issue is the function H5C__flush_single_entry of the file src/H5Centry.c. The manipulation leads to null pointer dereference. The attack needs to be approached locally. The exploit has been disclosed to the public and may be used.(CVE-2025-6858)\n\nA vulnerability classified as problematic was found in HDF5 1.14.6. This vulnerability affects the function H5FS__sinfo_serialize_node_cb of the file src/H5FScache.c. The manipulation leads to heap-based buffer overflow. Local access is required to approach this attack. The exploit has been disclosed to the public and may be used.(CVE-2025-7067)\n\nA vulnerability, which was classified as problematic, has been found in HDF5 1.14.6. This issue affects the function H5FL__malloc of the file src/H5FL.c. The manipulation leads to memory leak. Attacking locally is a requirement. The exploit has been disclosed to the public and may be used.(CVE-2025-7068)","affected":[{"package":{"name":"hdf5","ecosystem":"openEuler:24.03-LTS-SP3","purl":"pkg:rpm/openEuler/hdf5&distro=openEuler-24.03-LTS-SP3"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"1.14.5-3.oe2403sp3"}]}],"ecosystem_specific":{"aarch64":["hdf5-1.14.5-3.oe2403sp3.aarch64.rpm","hdf5-debuginfo-1.14.5-3.oe2403sp3.aarch64.rpm","hdf5-debugsource-1.14.5-3.oe2403sp3.aarch64.rpm","hdf5-devel-1.14.5-3.oe2403sp3.aarch64.rpm","hdf5-mpich-1.14.5-3.oe2403sp3.aarch64.rpm","hdf5-mpich-devel-1.14.5-3.oe2403sp3.aarch64.rpm","hdf5-mpich-static-1.14.5-3.oe2403sp3.aarch64.rpm","hdf5-openmpi-1.14.5-3.oe2403sp3.aarch64.rpm","hdf5-openmpi-devel-1.14.5-3.oe2403sp3.aarch64.rpm","hdf5-openmpi-static-1.14.5-3.oe2403sp3.aarch64.rpm"],"src":["hdf5-1.14.5-3.oe2403sp3.src.rpm"],"x86_64":["hdf5-1.14.5-3.oe2403sp3.x86_64.rpm","hdf5-debuginfo-1.14.5-3.oe2403sp3.x86_64.rpm","hdf5-debugsource-1.14.5-3.oe2403sp3.x86_64.rpm","hdf5-devel-1.14.5-3.oe2403sp3.x86_64.rpm","hdf5-mpich-1.14.5-3.oe2403sp3.x86_64.rpm","hdf5-mpich-devel-1.14.5-3.oe2403sp3.x86_64.rpm","hdf5-mpich-static-1.14.5-3.oe2403sp3.x86_64.rpm","hdf5-openmpi-1.14.5-3.oe2403sp3.x86_64.rpm","hdf5-openmpi-devel-1.14.5-3.oe2403sp3.x86_64.rpm","hdf5-openmpi-static-1.14.5-3.oe2403sp3.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2026-1131.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/zh/security/security-bulletins/detail/?id=openEuler-SA-2026-1131"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-2153"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-2310"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-2912"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-2913"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-2914"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-2923"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-2924"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-2925"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-2926"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-44905"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-6269"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-6516"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-6750"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-6816"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-6818"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-6856"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-6857"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-6858"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-7067"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-7068"}],"database_specific":{"severity":"High"}}