{"schema_version":"1.7.3","id":"OESA-2026-1257","published":"2026-01-30T12:28:04Z","modified":"2026-01-30T13:00:14.281591Z","upstream":["CVE-2026-22791","CVE-2026-23893"],"summary":"opencryptoki security update","details":"openCryptoki is an implementation of the PKCS #11 API that allows interfacing to devices that hold cryptographic information and perform cryptographic functions. openCryptoki provides application portability by isolating the application from the details of the cryptographic device. Isolating the application also provides an added level of security. The openCryptoki API provides a standard programming interface between applications and all kinds of portable cryptographic devices.\r\n\r\nSecurity Fix(es):\n\nopenCryptoki is a PKCS#11 library and tools for Linux and AIX. In 3.25.0 and 3.26.0, there is a heap buffer overflow vulnerability in the CKM_ECDH_AES_KEY_WRAP implementation allows an attacker with local access to cause out-of-bounds writes in the host process by supplying a compressed EC public key and invoking C_WrapKey. This can lead to heap corruption, or denial-of-service.(CVE-2026-22791)\n\nopenCryptoki is a PKCS#11 library and provides tooling for Linux and AIX. Versions 2.3.2 and above are vulnerable to symlink-following when running in privileged contexts. A token-group user can redirect file operations to arbitrary filesystem targets by planting symlinks in group-writable token directories, resulting in privilege escalation or data exposure. Token and lock directories are 0770 (group-writable for token users), so any token-group member can plant files and symlinks inside them. When run as root, the base code handling token directory file access, as well as several openCryptoki tools used for administrative purposes, may reset ownership or permissions on existing files inside the token directories. An attacker with token-group membership can exploit the system when an administrator runs a PKCS#11 application or administrative tool that performs chown on files inside the token directory during normal maintenance. This issue is fixed in commit 5e6e4b4, but has not been included in a released version at the time of publication.(CVE-2026-23893)","affected":[{"package":{"name":"opencryptoki","ecosystem":"openEuler:24.03-LTS-SP1","purl":"pkg:rpm/openEuler/opencryptoki&distro=openEuler-24.03-LTS-SP1"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"3.26.0-1.oe2403sp1"}]}],"ecosystem_specific":{"aarch64":["opencryptoki-3.26.0-1.oe2403sp1.aarch64.rpm","opencryptoki-debuginfo-3.26.0-1.oe2403sp1.aarch64.rpm","opencryptoki-debugsource-3.26.0-1.oe2403sp1.aarch64.rpm","opencryptoki-devel-3.26.0-1.oe2403sp1.aarch64.rpm"],"noarch":["opencryptoki-help-3.26.0-1.oe2403sp1.noarch.rpm"],"src":["opencryptoki-3.26.0-1.oe2403sp1.src.rpm"],"x86_64":["opencryptoki-3.26.0-1.oe2403sp1.x86_64.rpm","opencryptoki-debuginfo-3.26.0-1.oe2403sp1.x86_64.rpm","opencryptoki-debugsource-3.26.0-1.oe2403sp1.x86_64.rpm","opencryptoki-devel-3.26.0-1.oe2403sp1.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2026-1257.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/zh/security/security-bulletins/detail/?id=openEuler-SA-2026-1257"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2026-22791"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2026-23893"}],"database_specific":{"severity":"Medium"}}