{"schema_version":"1.7.3","id":"OESA-2025-2291","published":"2025-09-12T14:26:24Z","modified":"2025-09-12T19:01:04.416110Z","upstream":["CVE-2025-46727"],"summary":"rubygem-rack security update","details":"Rack provides a minimal, modular and adaptable interface for developing web applications in Ruby.  By wrapping HTTP requests and responses in the simplest way possible, it unifies and distills the API for web servers, web frameworks, and software in between (the so-called middleware) into a single method call.\r\n\r\nSecurity Fix(es):\n\nRack is a modular Ruby web server interface. Prior to versions 2.2.14, 3.0.16, and 3.1.14, `Rack::QueryParser` parses query strings and `application/x-www-form-urlencoded` bodies into Ruby data structures without imposing any limit on the number of parameters, allowing attackers to send requests with extremely large numbers of parameters. The vulnerability arises because `Rack::QueryParser` iterates over each `&amp;`-separated key-value pair and adds it to a Hash without enforcing an upper bound on the total number of parameters. This allows an attacker to send a single request containing hundreds of thousands (or more) of parameters, which consumes excessive memory and CPU during parsing. An attacker can trigger denial of service by sending specifically crafted HTTP requests, which can cause memory exhaustion or pin CPU resources, stalling or crashing the Rack server. This results in full service disruption until the affected worker is restarted. Versions 2.2.14, 3.0.16, and 3.1.14 fix the issue. Some other mitigations are available. One may use middleware to enforce a maximum query string size or parameter count, or employ a reverse proxy (such as Nginx) to limit request sizes and reject oversized query strings or bodies. Limiting request body sizes and query string lengths at the web server or CDN level is an effective mitigation.(CVE-2025-46727)","affected":[{"package":{"name":"rubygem-rack","ecosystem":"openEuler:24.03-LTS","purl":"pkg:rpm/openEuler/rubygem-rack&distro=openEuler-24.03-LTS"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"2.2.4-12.oe2403"}]}],"ecosystem_specific":{"noarch":["rubygem-rack-2.2.4-12.oe2403.noarch.rpm","rubygem-rack-help-2.2.4-12.oe2403.noarch.rpm"],"src":["rubygem-rack-2.2.4-12.oe2403.src.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2025-2291.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/zh/security/security-bulletins/detail/?id=openEuler-SA-2025-2291"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-46727"}],"database_specific":{"severity":"High"}}