{"schema_version":"1.7.3","id":"OESA-2023-1568","published":"2023-09-02T11:05:48Z","modified":"2025-09-03T06:17:01.976631Z","upstream":["CVE-2020-21469","CVE-2023-2454","CVE-2023-2455","CVE-2023-39417","CVE-2023-39418"],"summary":"libpq security update","details":"PostgreSQL is a powerful, open source object-relational database system that uses and extends the SQL language combined with many features that safely store and scale the most complicated data workloads. This package provides the essential shared library for any PostgreSQL client program or interface.\r\n\r\n\r\n\r\nSecurity Fix(es):\r\n\r\n** DISPUTED ** An issue was discovered in PostgreSQL 12.2 allows attackers to cause a denial of service via repeatedly sending SIGHUP signals. NOTE: this is disputed by the vendor because untrusted users cannot send SIGHUP signals; they can only be sent by a PostgreSQL superuser, a user with pg_reload_conf access, or a user with sufficient privileges at the OS level (the postgres account or the root account).(CVE-2020-21469)\r\n\r\nschema_element defeats protective search_path changes; It was found that certain database calls in PostgreSQL could permit an authed attacker with elevated database-level privileges to execute arbitrary code.(CVE-2023-2454)\r\n\r\nRow security policies disregard user ID changes after inlining; PostgreSQL could permit incorrect policies to be applied in certain cases where role-specific policies are used and a given query is planned under one role and then executed under other roles. This scenario can happen under security definer functions or when a common user and query is planned initially and then re-used across multiple SET ROLEs. Applying an incorrect policy may permit a user to complete otherwise-forbidden reads and modifications. This affects only databases that have used CREATE POLICY to define a row security policy.(CVE-2023-2455)\r\n\r\nIN THE EXTENSION SCRIPT, a SQL Injection vulnerability was found in PostgreSQL if it uses @extowner@, @extschema@, or @extschema:...@ inside a quoting construct (dollar quoting, &apos;&apos;, or &quot;&quot;). If an administrator has installed files of a vulnerable, trusted, non-bundled extension, an attacker with database-level CREATE privilege can execute arbitrary code as the bootstrap superuser.(CVE-2023-39417)\r\n\r\nA vulnerability was found in PostgreSQL with the use of the MERGE command, which fails to test new rows against row security policies defined for UPDATE and SELECT. If UPDATE and SELECT policies forbid some rows that INSERT policies do not forbid, a user could store such rows.(CVE-2023-39418)","affected":[{"package":{"name":"libpq","ecosystem":"openEuler:22.03-LTS-SP2","purl":"pkg:rpm/openEuler/libpq&distro=openEuler-22.03-LTS-SP2"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"13.12-1.oe2203sp2"}]}],"ecosystem_specific":{"aarch64":["libpq-debuginfo-13.12-1.oe2203sp2.aarch64.rpm","libpq-devel-13.12-1.oe2203sp2.aarch64.rpm","libpq-debugsource-13.12-1.oe2203sp2.aarch64.rpm","libpq-13.12-1.oe2203sp2.aarch64.rpm"],"src":["libpq-13.12-1.oe2203sp2.src.rpm"],"x86_64":["libpq-debuginfo-13.12-1.oe2203sp2.x86_64.rpm","libpq-debugsource-13.12-1.oe2203sp2.x86_64.rpm","libpq-13.12-1.oe2203sp2.x86_64.rpm","libpq-devel-13.12-1.oe2203sp2.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2023-1568.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/en/security/safety-bulletin/detail.html?id=openEuler-SA-2023-1568"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-21469"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-2454"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-2455"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-39417"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-39418"}],"database_specific":{"severity":"High"}}