{"schema_version":"1.7.3","id":"OESA-2025-1846","published":"2025-07-18T14:49:06Z","modified":"2025-09-03T06:31:23.835898Z","upstream":["CVE-2025-27613","CVE-2025-27614","CVE-2025-46334","CVE-2025-46835","CVE-2025-48384","CVE-2025-48385","CVE-2025-48386"],"summary":"git security update","details":"Security Fix(es):\n\nA vulnerability was found in Microsoft Visual Studio (Programming Tool Software) (affected version not known). It has been classified as problematic.This is going to have an impact on confidentiality, integrity, and availability.Applying a patch is able to eliminate this problem. A possible mitigation has been published immediately after the disclosure of the vulnerability.(CVE-2025-27613)\n\nA vulnerability was found in Microsoft Visual Studio (Programming Tool Software) (the affected version unknown). It has been declared as problematic.As an impact it is known to affect confidentiality, integrity, and availability.Applying a patch is able to eliminate this problem. A possible mitigation has been published immediately after the disclosure of the vulnerability.(CVE-2025-27614)\n\nA vulnerability, which was classified as problematic, has been found in Microsoft Visual Studio (Programming Tool Software) (version unknown).Impacted is confidentiality, integrity, and availability.Applying a patch is able to eliminate this problem. A possible mitigation has been published immediately after the disclosure of the vulnerability.(CVE-2025-46334)\n\nA vulnerability was found in j6t git-gui up to 2.50.0 (Versioning Software). It has been rated as critical.Using CWE to declare the problem leads to CWE-88. The product constructs a string for a command to be executed by a separate component\nin another control sphere, but it does not properly delimit the\nintended arguments, options, or switches within that command string.Impacted is confidentiality, integrity, and availability.The vulnerability scanner Nessus provides a plugin with the ID 241644 (FreeBSD : git -- multiple vulnerabilities (2a4472ed-5c0d-11f0-b991-291fce777db8)), which helps to determine the existence of the flaw in a target environment.Upgrading to version 2.43.7, 2.44.4, 2.45.4, 2.46.4, 2.47.3, 2.48.2, 2.49.1 or 2.50.1 eliminates this vulnerability.The vulnerability is also documented in the vulnerability database at Tenable (241644).(CVE-2025-46835)\n\nGit is a fast, scalable, distributed revision control system with an unusually rich command set that provides both high-level operations and full access to internals. When reading a config value, Git strips any trailing carriage return and line feed (CRLF). When writing a config entry, values with a trailing CR are not quoted, causing the CR to be lost when the config is later read. When initializing a submodule, if the submodule path contains a trailing CR, the altered path is read resulting in the submodule being checked out to an incorrect location. If a symlink exists that points the altered path to the submodule hooks directory, and the submodule contains an executable post-checkout hook, the script may be unintentionally executed after checkout. This vulnerability is fixed in v2.43.7, v2.44.4, v2.45.4, v2.46.4, v2.47.3, v2.48.2, v2.49.1, and v2.50.1.(CVE-2025-48384)\n\nGit is a fast, scalable, distributed revision control system with an unusually rich command set that provides both high-level operations and full access to internals. When cloning a repository Git knows to optionally fetch a bundle advertised by the remote server, which allows the server-side to offload parts of the clone to a CDN. The Git client does not perform sufficient validation of the advertised bundles, which allows the remote side to perform protocol injection. This protocol injection can cause the client to write the fetched bundle to a location controlled by the adversary. The fetched content is fully controlled by the server, which can in the worst case lead to arbitrary code execution. The use of bundle URIs is not enabled by default and can be controlled by the bundle.heuristic config option. Some cases of the vulnerability require that the adversary is in control of where a repository will be cloned to. This either requires social engineering or a recursive clone with submodules. These cases can thus be avoided by disabling recursive clones. This vulnerability is fixed in v2.43.7, v2.44.4, v2.45.4, v2.46.4, v2.47.3, v2.48.2, v2.49.1, and v2.50.1.(CVE-2025-48385)\n\nGit is a fast, scalable, distributed revision control system with an unusually rich command set that provides both high-level operations and full access to internals. The wincred credential helper uses a static buffer (target) as a unique key for storing and comparing against internal storage. This credential helper does not properly bounds check the available space remaining in the buffer before appending to it with wcsncat(), leading to potential buffer overflows. This vulnerability is fixed in v2.43.7, v2.44.4, v2.45.4, v2.46.4, v2.47.3, v2.48.2, v2.49.1, and v2.50.1.(CVE-2025-48386)","affected":[{"package":{"name":"git","ecosystem":"openEuler:24.03-LTS-SP1","purl":"pkg:rpm/openEuler/git&distro=openEuler-24.03-LTS-SP1"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"2.43.0-9.oe2403sp1"}]}],"ecosystem_specific":{"aarch64":["git-2.43.0-9.oe2403sp1.aarch64.rpm","git-core-2.43.0-9.oe2403sp1.aarch64.rpm","git-daemon-2.43.0-9.oe2403sp1.aarch64.rpm","git-debuginfo-2.43.0-9.oe2403sp1.aarch64.rpm","git-debugsource-2.43.0-9.oe2403sp1.aarch64.rpm"],"noarch":["git-email-2.43.0-9.oe2403sp1.noarch.rpm","git-gui-2.43.0-9.oe2403sp1.noarch.rpm","git-help-2.43.0-9.oe2403sp1.noarch.rpm","git-svn-2.43.0-9.oe2403sp1.noarch.rpm","git-web-2.43.0-9.oe2403sp1.noarch.rpm","gitk-2.43.0-9.oe2403sp1.noarch.rpm","perl-Git-2.43.0-9.oe2403sp1.noarch.rpm","perl-Git-SVN-2.43.0-9.oe2403sp1.noarch.rpm"],"src":["git-2.43.0-9.oe2403sp1.src.rpm"],"x86_64":["git-2.43.0-9.oe2403sp1.x86_64.rpm","git-core-2.43.0-9.oe2403sp1.x86_64.rpm","git-daemon-2.43.0-9.oe2403sp1.x86_64.rpm","git-debuginfo-2.43.0-9.oe2403sp1.x86_64.rpm","git-debugsource-2.43.0-9.oe2403sp1.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2025-1846.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/zh/security/security-bulletins/detail/?id=openEuler-SA-2025-1846"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-27613"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-27614"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-46334"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-46835"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-48384"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-48385"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-48386"}],"database_specific":{"severity":"High"}}