{"schema_version":"1.7.3","id":"OESA-2022-1950","published":"2022-09-23T11:04:20Z","modified":"2025-09-03T06:16:51.698696Z","upstream":["CVE-2019-14904","CVE-2020-10684","CVE-2020-10729","CVE-2020-1735","CVE-2020-1737","CVE-2020-1739","CVE-2020-1740","CVE-2020-1753","CVE-2021-20191"],"summary":"ansible security update","details":"\\\r\n\r\nSecurity Fix(es):\r\n\r\nA flaw was found in Ansible 2.7.16 and prior, 2.8.8 and prior, and 2.9.5 and prior when a password is set with the argument &quot;password&quot; of svn module, it is used on svn command line, disclosing to other users within the same node. An attacker could take advantage by reading the cmdline file from that particular PID on the procfs.(CVE-2020-1739)\r\n\r\nA flaw was found in Ansible Engine when using Ansible Vault for editing encrypted files. When a user executes &quot;ansible-vault edit&quot;, another user on the same computer can read the old and new secret, as it is created in a temporary file with mkstemp and the returned file descriptor is closed and the method write_data is called to write the existing secret in the file. This method will delete the file before recreating it insecurely. All versions in 2.7.x, 2.8.x and 2.9.x branches are believed to be vulnerable.(CVE-2020-1740)\r\n\r\nA flaw was found in the Ansible Engine when the fetch module is used. An attacker could intercept the module, inject a new path, and then choose a new destination path on the controller node. All versions in 2.7.x, 2.8.x and 2.9.x branches are believed to be vulnerable.(CVE-2020-1735)\r\n\r\nA flaw was found in Ansible Engine, all versions 2.7.x, 2.8.x and 2.9.x prior to 2.7.17, 2.8.9 and 2.9.6 respectively, when using ansible_facts as a subkey of itself and promoting it to a variable when inject is enabled, overwriting the ansible_facts after the clean. An attacker could take advantage of this by altering the ansible_facts, such as ansible_hosts, users and any other key data which would lead into privilege escalation or code injection.(CVE-2020-10684)\r\n\r\nA flaw was found in the solaris_zone module from the Ansible Community modules. When setting the name for the zone on the Solaris host, the zone name is checked by listing the process with the &apos;ps&apos; bare command on the remote machine. An attacker could take advantage of this flaw by crafting the name of the zone and executing arbitrary commands in the remote host. Ansible Engine 2.7.15, 2.8.7, and 2.9.2 as well as previous versions are affected.(CVE-2019-14904)\r\n\r\nA flaw was found in Ansible 2.7.17 and prior, 2.8.9 and prior, and 2.9.6 and prior when using the Extract-Zip function from the win_unzip module as the extracted file(s) are not checked if they belong to the destination folder. An attacker could take advantage of this flaw by crafting an archive anywhere in the file system, using a path traversal. This issue is fixed in 2.10.(CVE-2020-1737)\r\n\r\nA flaw was found in ansible. Credentials, such as secrets, are being disclosed in console log by default and not protected by no_log feature when using those modules. An attacker can take advantage of this information to steal those credentials. The highest threat from this vulnerability is to data confidentiality. Versions before ansible 2.9.18 are affected.(CVE-2021-20191)\r\n\r\nA flaw was found in the use of insufficiently random values in Ansible. Two random password lookups of the same length generate the equal value as the template caching action for the same file since no re-evaluation happens. The highest threat from this vulnerability would be that all passwords are exposed at once for the file. This flaw affects Ansible Engine versions before 2.9.6.(CVE-2020-10729)\r\n\r\nA security flaw was found in Ansible Engine, all Ansible 2.7.x versions prior to 2.7.17, all Ansible 2.8.x versions prior to 2.8.11 and all Ansible 2.9.x versions prior to 2.9.7, when managing kubernetes using the k8s module. Sensitive parameters such as passwords and tokens are passed to kubectl from the command line, not using an environment variable or an input configuration file. This will disclose passwords and tokens from process list and no_log directive from debug module would not have any effect making these secrets being disclosed on stdout and log files.(CVE-2020-1753)","affected":[{"package":{"name":"ansible","ecosystem":"openEuler:20.03-LTS-SP1","purl":"pkg:rpm/openEuler/ansible&distro=openEuler-20.03-LTS-SP1"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"2.5.5-6.oe1"}]}],"ecosystem_specific":{"noarch":["ansible-2.5.5-6.oe1.noarch.rpm","ansible-help-2.5.5-6.oe1.noarch.rpm"],"src":["ansible-2.5.5-6.oe1.src.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2022-1950.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/en/security/safety-bulletin/detail.html?id=openEuler-SA-2022-1950"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-1739"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-1740"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-1735"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-10684"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2019-14904"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-1737"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-20191"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-10729"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-1753"}],"database_specific":{"severity":"High"}}