{"schema_version":"1.7.3","id":"OESA-2023-1673","published":"2023-09-22T11:05:59Z","modified":"2025-09-03T06:17:00.673873Z","upstream":["CVE-2020-15670","CVE-2020-15673","CVE-2020-15674","CVE-2020-15675","CVE-2020-15680","CVE-2020-15681","CVE-2020-15682","CVE-2020-15683","CVE-2020-15684","CVE-2020-16012","CVE-2020-16044","CVE-2020-26950","CVE-2020-26951","CVE-2020-26953","CVE-2020-26956","CVE-2020-26958","CVE-2020-26959","CVE-2020-26960","CVE-2020-26961","CVE-2020-26962","CVE-2020-26965","CVE-2020-26968","CVE-2020-26969","CVE-2020-26971","CVE-2020-26972","CVE-2020-26973","CVE-2020-26974","CVE-2020-26976","CVE-2020-26978","CVE-2020-26979","CVE-2020-35111","CVE-2020-35113","CVE-2020-35114","CVE-2021-23953","CVE-2021-23954","CVE-2021-23955","CVE-2021-23956","CVE-2021-23958","CVE-2021-23960","CVE-2021-23961","CVE-2021-23962","CVE-2021-23963","CVE-2021-23964","CVE-2021-23965","CVE-2021-23968","CVE-2021-23969","CVE-2021-23970","CVE-2021-23971","CVE-2021-23972","CVE-2021-23973","CVE-2021-23974","CVE-2021-23975","CVE-2021-23978","CVE-2021-23979","CVE-2021-23981","CVE-2021-23982","CVE-2021-23983","CVE-2021-23984","CVE-2021-23985","CVE-2021-23986","CVE-2021-23987","CVE-2021-23988","CVE-2021-23994","CVE-2021-23995","CVE-2021-23996","CVE-2021-23997","CVE-2021-23998","CVE-2021-23999","CVE-2021-24000","CVE-2021-24001","CVE-2021-24002","CVE-2021-29944","CVE-2021-29945","CVE-2021-29946","CVE-2021-29947","CVE-2021-29952","CVE-2021-29953","CVE-2021-29955","CVE-2021-29959","CVE-2021-29960","CVE-2021-29961","CVE-2021-29965","CVE-2021-29966","CVE-2021-29967","CVE-2021-29970","CVE-2021-29972","CVE-2021-29974","CVE-2021-29975","CVE-2021-29976","CVE-2021-29977","CVE-2021-29980","CVE-2021-29981","CVE-2021-29982","CVE-2021-29984","CVE-2021-29985","CVE-2021-29986","CVE-2021-29987","CVE-2021-29988","CVE-2021-29989","CVE-2021-29990","CVE-2021-29991","CVE-2021-30547","CVE-2021-32810","CVE-2021-38491","CVE-2021-38493","CVE-2021-38494","CVE-2021-38496","CVE-2021-38497","CVE-2021-38498","CVE-2021-38499","CVE-2021-38500","CVE-2021-38501","CVE-2021-38503","CVE-2021-38504","CVE-2021-38506","CVE-2021-38507","CVE-2021-38508","CVE-2021-38509","CVE-2021-38510","CVE-2021-4140","CVE-2021-43531","CVE-2021-43532","CVE-2021-43533","CVE-2021-43534","CVE-2021-43535","CVE-2021-43536","CVE-2021-43537","CVE-2021-43538","CVE-2021-43539","CVE-2021-43540","CVE-2021-43541","CVE-2021-43542","CVE-2021-43543","CVE-2021-43545","CVE-2021-43546","CVE-2022-0511","CVE-2022-0843","CVE-2022-1097","CVE-2022-1196","CVE-2022-1529","CVE-2022-1802","CVE-2022-1919","CVE-2022-2200","CVE-2022-22737","CVE-2022-22738","CVE-2022-22739","CVE-2022-22740","CVE-2022-22741","CVE-2022-22742","CVE-2022-22743","CVE-2022-22745","CVE-2022-22747","CVE-2022-22748","CVE-2022-22754","CVE-2022-22755","CVE-2022-22756","CVE-2022-22757","CVE-2022-22759","CVE-2022-22760","CVE-2022-22761","CVE-2022-22763","CVE-2022-24713","CVE-2022-26381","CVE-2022-26382","CVE-2022-26383","CVE-2022-26384","CVE-2022-26385","CVE-2022-26386","CVE-2022-26387","CVE-2022-26485","CVE-2022-26486","CVE-2022-28281","CVE-2022-28282","CVE-2022-28283","CVE-2022-28284","CVE-2022-28285","CVE-2022-28286","CVE-2022-28287","CVE-2022-28289","CVE-2022-29909","CVE-2022-29911","CVE-2022-29912","CVE-2022-29914","CVE-2022-29915","CVE-2022-29916","CVE-2022-29918","CVE-2022-31736","CVE-2022-31737","CVE-2022-31738","CVE-2022-31740","CVE-2022-31741","CVE-2022-31742","CVE-2022-31743","CVE-2022-31744","CVE-2022-31745","CVE-2022-31748","CVE-2022-3266","CVE-2022-34468","CVE-2022-34469","CVE-2022-34470","CVE-2022-34471","CVE-2022-34472","CVE-2022-34473","CVE-2022-34474","CVE-2022-34475","CVE-2022-34476","CVE-2022-34477","CVE-2022-34479","CVE-2022-34480","CVE-2022-34481","CVE-2022-34482","CVE-2022-34483","CVE-2022-34484","CVE-2022-34485","CVE-2022-36318","CVE-2022-36319","CVE-2022-38472","CVE-2022-38473","CVE-2022-38477","CVE-2022-38478","CVE-2022-40956","CVE-2022-40957","CVE-2022-40958","CVE-2022-40959","CVE-2022-40960","CVE-2022-40962","CVE-2022-42928","CVE-2022-45408","CVE-2022-45409","CVE-2022-45410","CVE-2022-45411","CVE-2022-45412","CVE-2022-45416","CVE-2022-45418","CVE-2022-45420","CVE-2022-45421","CVE-2022-46871","CVE-2022-46874","CVE-2022-46875","CVE-2022-46878","CVE-2022-46882","CVE-2023-0767","CVE-2023-1945","CVE-2023-23598","CVE-2023-23599","CVE-2023-23601","CVE-2023-23602","CVE-2023-23603","CVE-2023-25728","CVE-2023-25729","CVE-2023-25730","CVE-2023-25732","CVE-2023-25735","CVE-2023-25737","CVE-2023-25739","CVE-2023-25742","CVE-2023-25751","CVE-2023-25752","CVE-2023-28162","CVE-2023-28164","CVE-2023-28176","CVE-2023-29533","CVE-2023-29535","CVE-2023-29536","CVE-2023-29539","CVE-2023-29541","CVE-2023-29548","CVE-2023-29550","CVE-2023-32205","CVE-2023-32206","CVE-2023-32207","CVE-2023-32211","CVE-2023-32212","CVE-2023-32213","CVE-2023-32215","CVE-2023-37201","CVE-2023-37202","CVE-2023-37207","CVE-2023-37208","CVE-2023-37211","CVE-2023-4045","CVE-2023-4046","CVE-2023-4047","CVE-2023-4048","CVE-2023-4049","CVE-2023-4050","CVE-2023-4054","CVE-2023-4055","CVE-2023-4056"],"summary":"firefox security update","details":"Mozilla Firefox is a standalone web browser, designed for standards compliance and performance.  Its functionality can be enhanced via a plethora of extensions.\r\n\r\nMozilla Firefox is an open-source web browser, designed for standards compliance, performance and portability.\r\n\r\nSecurity Fix(es):\r\n\r\nMozilla developers reported memory safety bugs present in Firefox for Android 79. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 80, Firefox ESR &lt; 78.2, Thunderbird &lt; 78.2, and Firefox for Android &lt; 80.(CVE-2020-15670)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 80 and Firefox ESR 78.2. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 81, Thunderbird &lt; 78.3, and Firefox ESR &lt; 78.3.(CVE-2020-15673)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 80. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 81.(CVE-2020-15674)\r\n\r\nWhen processing surfaces, the lifetime may outlive a persistent buffer leading to memory corruption and a potentially exploitable crash. This vulnerability affects Firefox &lt; 81.(CVE-2020-15675)\r\n\r\nIf a valid external protocol handler was referenced in an image tag, the resulting broken image size could be distinguished from a broken image size of a non-existent protocol handler. This allowed an attacker to successfully probe whether an external protocol handler was registered. This vulnerability affects Firefox &lt; 82.(CVE-2020-15680)\r\n\r\nWhen multiple WASM threads had a reference to a module, and were looking up exported functions, one WASM thread could have overwritten another&apos;s entry in a shared stub table, resulting in a potentially exploitable crash. This vulnerability affects Firefox &lt; 82.(CVE-2020-15681)\r\n\r\nWhen a link to an external protocol was clicked, a prompt was presented that allowed the user to choose what application to open it in. An attacker could induce that prompt to be associated with an origin they didn&apos;t control, resulting in a spoofing attack. This was fixed by changing external protocol prompts to be tab-modal while also ensuring they could not be incorrectly associated with a different origin. This vulnerability affects Firefox &lt; 82.(CVE-2020-15682)\r\n\r\nMozilla developers and community members reported memory safety bugs present in Firefox 81 and Firefox ESR 78.3. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox ESR &lt; 78.4, Firefox &lt; 82, and Thunderbird &lt; 78.4.(CVE-2020-15683)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 81. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 82.(CVE-2020-15684)\r\n\r\nSide-channel information leakage in graphics in Google Chrome prior to 87.0.4280.66 allowed a remote attacker to leak cross-origin data via a crafted HTML page.(CVE-2020-16012)\r\n\r\nUse after free in WebRTC in Google Chrome prior to 88.0.4324.96 allowed a remote attacker to potentially exploit heap corruption via a crafted SCTP packet.(CVE-2020-16044)\r\n\r\nIn certain circumstances, the MCallGetProperty opcode can be emitted with unmet assumptions resulting in an exploitable use-after-free condition. This vulnerability affects Firefox &lt; 82.0.3, Firefox ESR &lt; 78.4.1, and Thunderbird &lt; 78.4.2.(CVE-2020-26950)\r\n\r\n(CVE-2020-26951)\r\n\r\n(CVE-2020-26953)\r\n\r\n(CVE-2020-26956)\r\n\r\n(CVE-2020-26958)\r\n\r\n(CVE-2020-26959)\r\n\r\n(CVE-2020-26960)\r\n\r\n(CVE-2020-26961)\r\n\r\n(CVE-2020-26962)\r\n\r\n(CVE-2020-26965)\r\n\r\n(CVE-2020-26968)\r\n\r\n(CVE-2020-26969)\r\n\r\nCertain blit values provided by the user were not properly constrained leading to a heap buffer overflow on some video drivers. This vulnerability affects Firefox &lt; 84, Thunderbird &lt; 78.6, and Firefox ESR &lt; 78.6.(CVE-2020-26971)\r\n\r\nThe lifecycle of IPC Actors allows managed actors to outlive their manager actors; and the former must ensure that they are not attempting to use a dead actor they have a reference to. Such a check was omitted in WebGL, resulting in a use-after-free and a potentially exploitable crash. This vulnerability affects Firefox &lt; 84.(CVE-2020-26972)\r\n\r\nCertain input to the CSS Sanitizer confused it, resulting in incorrect components being removed. This could have been used as a sanitizer bypass. This vulnerability affects Firefox &lt; 84, Thunderbird &lt; 78.6, and Firefox ESR &lt; 78.6.(CVE-2020-26973)\r\n\r\nWhen flex-basis was used on a table wrapper, a StyleGenericFlexBasis object could have been incorrectly cast to the wrong type. This resulted in a heap user-after-free, memory corruption, and a potentially exploitable crash. This vulnerability affects Firefox &lt; 84, Thunderbird &lt; 78.6, and Firefox ESR &lt; 78.6.(CVE-2020-26974)\r\n\r\nWhen a HTTPS pages was embedded in a HTTP page, and there was a service worker registered for the former, the service worker could have intercepted the request for the secure page despite the iframe not being a secure context due to the (insecure) framing. This vulnerability affects Firefox &lt; 84.(CVE-2020-26976)\r\n\r\nUsing techniques that built on the slipstream research, a malicious webpage could have exposed both an internal network&apos;s hosts as well as services running on the user&apos;s local machine. This vulnerability affects Firefox &lt; 84, Thunderbird &lt; 78.6, and Firefox ESR &lt; 78.6.(CVE-2020-26978)\r\n\r\nWhen a user typed a URL in the address bar or the search bar and quickly hit the enter key, a website could sometimes capture that event and then redirect the user before navigation occurred to the desired, entered address. To construct a convincing spoof the attacker would have had to guess what the user was typing, perhaps by suggesting it. This vulnerability affects Firefox &lt; 84.(CVE-2020-26979)\r\n\r\nWhen an extension with the proxy permission registered to receive &lt;all_urls&gt;, the proxy.onRequest callback was not triggered for view-source URLs. While web content cannot navigate to such URLs, a user opening View Source could have inadvertently leaked their IP address. This vulnerability affects Firefox &lt; 84, Thunderbird &lt; 78.6, and Firefox ESR &lt; 78.6.(CVE-2020-35111)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 83 and Firefox ESR 78.5. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 84, Thunderbird &lt; 78.6, and Firefox ESR &lt; 78.6.(CVE-2020-35113)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 83. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 84.(CVE-2020-35114)\r\n\r\nIf a user clicked into a specifically crafted PDF, the PDF reader could be confused into leaking cross-origin information, when said information is served as chunked data. This vulnerability affects Firefox &lt; 85, Thunderbird &lt; 78.7, and Firefox ESR &lt; 78.7.(CVE-2021-23953)\r\n\r\nUsing the new logical assignment operators in a JavaScript switch statement could have caused a type confusion, leading to a memory corruption and a potentially exploitable crash. This vulnerability affects Firefox &lt; 85, Thunderbird &lt; 78.7, and Firefox ESR &lt; 78.7.(CVE-2021-23954)\r\n\r\nThe browser could have been confused into transferring a pointer lock state into another tab, which could have lead to clickjacking attacks. This vulnerability affects Firefox &lt; 85.(CVE-2021-23955)\r\n\r\nAn ambiguous file picker design could have confused users who intended to select and upload a single file into uploading a whole directory. This was addressed by adding a new prompt. This vulnerability affects Firefox &lt; 85.(CVE-2021-23956)\r\n\r\nThe browser could have been confused into transferring a screen sharing state into another tab, which would leak unintended information. This vulnerability affects Firefox &lt; 85.(CVE-2021-23958)\r\n\r\nPerforming garbage collection on re-declared JavaScript variables resulted in a user-after-poison, and a potentially exploitable crash. This vulnerability affects Firefox &lt; 85, Thunderbird &lt; 78.7, and Firefox ESR &lt; 78.7.(CVE-2021-23960)\r\n\r\nFurther techniques that built on the slipstream research combined with a malicious webpage could have exposed both an internal network&apos;s hosts as well as services running on the user&apos;s local machine. This vulnerability affects Firefox &lt; 85.(CVE-2021-23961)\r\n\r\nIncorrect use of the &apos;&lt;RowCountChanged&gt;&apos; method could have led to a user-after-poison and a potentially exploitable crash. This vulnerability affects Firefox &lt; 85.(CVE-2021-23962)\r\n\r\nWhen sharing geolocation during an active WebRTC share, Firefox could have reset the webRTC sharing state in the user interface, leading to loss of control over the currently granted permission. This vulnerability affects Firefox &lt; 85.(CVE-2021-23963)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 84 and Firefox ESR 78.6. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 85, Thunderbird &lt; 78.7, and Firefox ESR &lt; 78.7.(CVE-2021-23964)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 84. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 85.(CVE-2021-23965)\r\n\r\nIf Content Security Policy blocked frame navigation, the full destination of a redirect served in the frame was reported in the violation report; as opposed to the original frame URI. This could be used to leak sensitive information contained in such URIs. This vulnerability affects Firefox &lt; 86, Thunderbird &lt; 78.8, and Firefox ESR &lt; 78.8.(CVE-2021-23968)\r\n\r\nAs specified in the W3C Content Security Policy draft, when creating a violation report, &quot;User agents need to ensure that the source file is the URL requested by the page, pre-redirects. If that’s not possible, user agents need to strip the URL down to an origin to avoid unintentional leakage.&quot; Under certain types of redirects, Firefox incorrectly set the source file to be the destination of the redirects. This was fixed to be the redirect destination&apos;s origin. This vulnerability affects Firefox &lt; 86, Thunderbird &lt; 78.8, and Firefox ESR &lt; 78.8.(CVE-2021-23969)\r\n\r\nContext-specific code was included in a shared jump table; resulting in assertions being triggered in multithreaded wasm code. This vulnerability affects Firefox &lt; 86.(CVE-2021-23970)\r\n\r\nWhen processing a redirect with a conflicting Referrer-Policy, Firefox would have adopted the redirect&apos;s Referrer-Policy. This would have potentially resulted in more information than intended by the original origin being provided to the destination of the redirect. This vulnerability affects Firefox &lt; 86.(CVE-2021-23971)\r\n\r\nOne phishing tactic on the web is to provide a link with HTTP Auth. For example &apos;https://www.phishingtarget.com@evil.com&apos;. To mitigate this type of attack, Firefox will display a warning dialog; however, this warning dialog would not have been displayed if evil.com used a redirect that was cached by the browser. This vulnerability affects Firefox &lt; 86.(CVE-2021-23972)\r\n\r\nWhen trying to load a cross-origin resource in an audio/video context a decoding error may have resulted, and the content of that error may have revealed information about the resource. This vulnerability affects Firefox &lt; 86, Thunderbird &lt; 78.8, and Firefox ESR &lt; 78.8.(CVE-2021-23973)\r\n\r\nThe DOMParser API did not properly process &apos;&lt;noscript&gt;&apos; elements for escaping. This could be used as an mXSS vector to bypass an HTML Sanitizer. This vulnerability affects Firefox &lt; 86.(CVE-2021-23974)\r\n\r\nThe developer page about:memory has a Measure function for exploring what object types the browser has allocated and their sizes. When this function was invoked we incorrectly called the sizeof function, instead of using the API method that checks for invalid pointers. This vulnerability affects Firefox &lt; 86.(CVE-2021-23975)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 85 and Firefox ESR 78.7. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 86, Thunderbird &lt; 78.8, and Firefox ESR &lt; 78.8.(CVE-2021-23978)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 85. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 86.(CVE-2021-23979)\r\n\r\nA texture upload of a Pixel Buffer Object could have confused the WebGL code to skip binding the buffer used to unpack it, resulting in memory corruption and a potentially exploitable information leak or crash. This vulnerability affects Firefox ESR &lt; 78.9, Firefox &lt; 87, and Thunderbird &lt; 78.9.(CVE-2021-23981)\r\n\r\nUsing techniques that built on the slipstream research, a malicious webpage could have scanned both an internal network&apos;s hosts as well as services running on the user&apos;s local machine utilizing WebRTC connections. This vulnerability affects Firefox ESR &lt; 78.9, Firefox &lt; 87, and Thunderbird &lt; 78.9.(CVE-2021-23982)\r\n\r\nBy causing a transition on a parent node by removing a CSS rule, an invalid property for a marker could have been applied, resulting in memory corruption and a potentially exploitable crash. This vulnerability affects Firefox &lt; 87.(CVE-2021-23983)\r\n\r\nA malicious extension could have opened a popup window lacking an address bar. The title of the popup lacking an address bar should not be fully controllable, but in this situation was. This could have been used to spoof a website and attempt to trick the user into providing credentials. This vulnerability affects Firefox ESR &lt; 78.9, Firefox &lt; 87, and Thunderbird &lt; 78.9.(CVE-2021-23984)\r\n\r\nIf an attacker is able to alter specific about:config values (for example malware running on the user&apos;s computer), the Devtools remote debugging feature could have been enabled in a way that was unnoticable to the user. This would have allowed a remote attacker (able to make a direct network connection to the victim) to monitor the user&apos;s browsing activity and (plaintext) network traffic. This was addressed by providing a visual cue when Devtools has an open network socket. This vulnerability affects Firefox &lt; 87.(CVE-2021-23985)\r\n\r\nA malicious extension with the &apos;search&apos; permission could have installed a new search engine whose favicon referenced a cross-origin URL. The response to this cross-origin request could have been read by the extension, allowing a same-origin policy bypass by the extension, which should not have cross-origin permissions. This cross-origin request was made without cookies, so the sensitive information disclosed by the violation was limited to local-network resources or resources that perform IP-based authentication. This vulnerability affects Firefox &lt; 87.(CVE-2021-23986)\r\n\r\nMozilla developers and community members reported memory safety bugs present in Firefox 86 and Firefox ESR 78.8. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox ESR &lt; 78.9, Firefox &lt; 87, and Thunderbird &lt; 78.9.(CVE-2021-23987)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 86. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 87.(CVE-2021-23988)\r\n\r\nA WebGL framebuffer was not initialized early enough, resulting in memory corruption and an out of bound write. This vulnerability affects Firefox ESR &lt; 78.10, Thunderbird &lt; 78.10, and Firefox &lt; 88.(CVE-2021-23994)\r\n\r\nWhen Responsive Design Mode was enabled, it used references to objects that were previously freed. We presume that with enough effort this could have been exploited to run arbitrary code. This vulnerability affects Firefox ESR &lt; 78.10, Thunderbird &lt; 78.10, and Firefox &lt; 88.(CVE-2021-23995)\r\n\r\nBy utilizing 3D CSS in conjunction with Javascript, content could have been rendered outside the webpage&apos;s viewport, resulting in a spoofing attack that could have been used for phishing or other attacks on a user. This vulnerability affects Firefox &lt; 88.(CVE-2021-23996)\r\n\r\nDue to unexpected data type conversions, a use-after-free could have occurred when interacting with the font cache. We presume that with enough effort this could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 88.(CVE-2021-23997)\r\n\r\nThrough complicated navigations with new windows, an HTTP page could have inherited a secure lock icon from an HTTPS page. This vulnerability affects Firefox ESR &lt; 78.10, Thunderbird &lt; 78.10, and Firefox &lt; 88.(CVE-2021-23998)\r\n\r\nIf a Blob URL was loaded through some unusual user interaction, it could have been loaded by the System Principal and granted additional privileges that should not be granted to web content. This vulnerability affects Firefox ESR &lt; 78.10, Thunderbird &lt; 78.10, and Firefox &lt; 88.(CVE-2021-23999)\r\n\r\nA race condition with requestPointerLock() and setTimeout() could have resulted in a user interacting with one tab when they believed they were on a separate tab. In conjunction with certain elements (such as &amp;lt;input type=&quot;file&quot;&amp;gt;) this could have led to an attack where a user was confused about the origin of the webpage and potentially disclosed information they did not intend to. This vulnerability affects Firefox &lt; 88.(CVE-2021-24000)\r\n\r\nA compromised content process could have performed session history manipulations it should not have been able to due to testing infrastructure that was not restricted to testing-only configurations. This vulnerability affects Firefox &lt; 88.(CVE-2021-24001)\r\n\r\nWhen a user clicked on an FTP URL containing encoded newline characters (%0A and %0D), the newlines would have been interpreted as such and allowed arbitrary commands to be sent to the FTP server. This vulnerability affects Firefox ESR &lt; 78.10, Thunderbird &lt; 78.10, and Firefox &lt; 88.(CVE-2021-24002)\r\n\r\nLack of escaping allowed HTML injection when a webpage was viewed in Reader View. While a Content Security Policy prevents direct code execution, HTML injection is still possible. *Note: This issue only affected Firefox for Android. Other operating systems are unaffected.*. This vulnerability affects Firefox &lt; 88.(CVE-2021-29944)\r\n\r\nThe WebAssembly JIT could miscalculate the size of a return type, which could lead to a null read and result in a crash. *Note: This issue only affected x86-32 platforms. Other platforms are unaffected.*. This vulnerability affects Firefox ESR &lt; 78.10, Thunderbird &lt; 78.10, and Firefox &lt; 88.(CVE-2021-29945)\r\n\r\nPorts that were written as an integer overflow above the bounds of a 16-bit integer could have bypassed port blocking restrictions when used in the Alt-Svc header. This vulnerability affects Firefox ESR &lt; 78.10, Thunderbird &lt; 78.10, and Firefox &lt; 88.(CVE-2021-29946)\r\n\r\nMozilla developers and community members reported memory safety bugs present in Firefox 87. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 88.(CVE-2021-29947)\r\n\r\nWhen Web Render components were destructed, a race condition could have caused undefined behavior, and we presume that with enough effort may have been exploitable to run arbitrary code. This vulnerability affects Firefox &lt; 88.0.1 and Firefox for Android &lt; 88.1.3.(CVE-2021-29952)\r\n\r\nA malicious webpage could have forced a Firefox for Android user into executing attacker-controlled JavaScript in the context of another domain, resulting in a Universal Cross-Site Scripting vulnerability. *Note: This issue only affected Firefox for Android. Other operating systems are unaffected. Further details are being temporarily withheld to allow users an opportunity to update.*. This vulnerability affects Firefox &lt; 88.0.1 and Firefox for Android &lt; 88.1.3.(CVE-2021-29953)\r\n\r\nA transient execution vulnerability, named Floating Point Value Injection (FPVI) allowed an attacker to leak arbitrary memory addresses and may have also enabled JIT type confusion attacks. (A related vulnerability, Speculative Code Store Bypass (SCSB), did not affect Firefox.). This vulnerability affects Firefox ESR &lt; 78.9 and Firefox &lt; 87.(CVE-2021-29955)\r\n\r\nWhen a user has already allowed a website to access microphone and camera, disabling camera sharing would not fully prevent the website from re-enabling it without an additional prompt. This was only possible if the website kept recording with the microphone until re-enabling the camera. This vulnerability affects Firefox &lt; 89.(CVE-2021-29959)\r\n\r\nFirefox used to cache the last filename used for printing a file. When generating a filename for printing, Firefox usually suggests the web page title. The caching and suggestion techniques combined may have lead to the title of a website visited during private browsing mode being stored on disk. This vulnerability affects Firefox &lt; 89.(CVE-2021-29960)\r\n\r\nWhen styling and rendering an oversized `&lt;select&gt;` element, Firefox did not apply correct clipping which allowed an attacker to paint over the user interface. This vulnerability affects Firefox &lt; 89.(CVE-2021-29961)\r\n\r\nA malicious website that causes an HTTP Authentication dialog to be spawned could trick the built-in password manager to suggest passwords for the currently active website instead of the website that triggered the dialog. *This bug only affects Firefox for Android. Other operating systems are unaffected.*. This vulnerability affects Firefox &lt; 89.(CVE-2021-29965)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 88. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 89.(CVE-2021-29966)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 88 and Firefox ESR 78.11. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird &lt; 78.11, Firefox &lt; 89, and Firefox ESR &lt; 78.11.(CVE-2021-29967)\r\n\r\nA malicious webpage could have triggered a use-after-free, memory corruption, and a potentially exploitable crash. *This bug could only be triggered when accessibility was enabled.*. This vulnerability affects Thunderbird &lt; 78.12, Firefox ESR &lt; 78.12, and Firefox &lt; 90.(CVE-2021-29970)\r\n\r\nA use-after-free vulnerability was found via testing, and traced to an out-of-date Cairo library. Updating the library resolved the issue, and may have remediated other, unknown security vulnerabilities as well. This vulnerability affects Firefox &lt; 90.(CVE-2021-29972)\r\n\r\nWhen network partitioning was enabled, e.g. as a result of Enhanced Tracking Protection settings, a TLS error page would allow the user to override an error on a domain which had specified HTTP Strict Transport Security (which implies that the error should not be override-able.) This issue did not affect the network connections, and they were correctly upgraded to HTTPS automatically. This vulnerability affects Firefox &lt; 90.(CVE-2021-29974)\r\n\r\nThrough a series of DOM manipulations, a message, over which the attacker had control of the text but not HTML or formatting, could be overlaid on top of another domain (with the new domain correctly shown in the address bar) resulting in possible user confusion. This vulnerability affects Firefox &lt; 90.(CVE-2021-29975)\r\n\r\nMozilla developers reported memory safety bugs present in code shared between Firefox and Thunderbird. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird &lt; 78.12, Firefox ESR &lt; 78.12, and Firefox &lt; 90.(CVE-2021-29976)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 89. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 90.(CVE-2021-29977)\r\n\r\nUninitialized memory in a canvas object could have caused an incorrect free() leading to memory corruption and a potentially exploitable crash. This vulnerability affects Thunderbird &lt; 78.13, Thunderbird &lt; 91, Firefox ESR &lt; 78.13, and Firefox &lt; 91.(CVE-2021-29980)\r\n\r\nAn issue present in lowering/register allocation could have led to obscure but deterministic register confusion failures in JITted code that would lead to a potentially exploitable crash. This vulnerability affects Firefox &lt; 91 and Thunderbird &lt; 91.(CVE-2021-29981)\r\n\r\nDue to incorrect JIT optimization, we incorrectly interpreted data from the wrong type of object, resulting in the potential leak of a single bit of memory. This vulnerability affects Firefox &lt; 91 and Thunderbird &lt; 91.(CVE-2021-29982)\r\n\r\nInstruction reordering resulted in a sequence of instructions that would cause an object to be incorrectly considered during garbage collection. This led to memory corruption and a potentially exploitable crash. This vulnerability affects Thunderbird &lt; 78.13, Thunderbird &lt; 91, Firefox ESR &lt; 78.13, and Firefox &lt; 91.(CVE-2021-29984)\r\n\r\nA use-after-free vulnerability in media channels could have led to memory corruption and a potentially exploitable crash. This vulnerability affects Thunderbird &lt; 78.13, Thunderbird &lt; 91, Firefox ESR &lt; 78.13, and Firefox &lt; 91.(CVE-2021-29985)\r\n\r\nA suspected race condition when calling getaddrinfo led to memory corruption and a potentially exploitable crash. *Note: This issue only affected Linux operating systems. Other operating systems are unaffected.* This vulnerability affects Thunderbird &lt; 78.13, Thunderbird &lt; 91, Firefox ESR &lt; 78.13, and Firefox &lt; 91.(CVE-2021-29986)\r\n\r\nAfter requesting multiple permissions, and closing the first permission panel, subsequent permission panels will be displayed in a different position but still record a click in the default location, making it possible to trick a user into accepting a permission they did not want to. *This bug only affects Firefox on Linux. Other operating systems are unaffected.*. This vulnerability affects Firefox &lt; 91 and Thunderbird &lt; 91.(CVE-2021-29987)\r\n\r\nFirefox incorrectly treated an inline list-item element as a block element, resulting in an out of bounds read or memory corruption, and a potentially exploitable crash. This vulnerability affects Thunderbird &lt; 78.13, Thunderbird &lt; 91, Firefox ESR &lt; 78.13, and Firefox &lt; 91.(CVE-2021-29988)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 90 and Firefox ESR 78.12. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird &lt; 78.13, Firefox ESR &lt; 78.13, and Firefox &lt; 91.(CVE-2021-29989)\r\n\r\nMozilla developers and community members reported memory safety bugs present in Firefox 90. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 91.(CVE-2021-29990)\r\n\r\nFirefox incorrectly accepted a newline in a HTTP/3 header, interpretting it as two separate headers. This allowed for a header splitting attack against servers using HTTP/3. This vulnerability affects Firefox &lt; 91.0.1 and Thunderbird &lt; 91.0.1.(CVE-2021-29991)\r\n\r\nOut of bounds write in ANGLE in Google Chrome prior to 91.0.4472.101 allowed a remote attacker to potentially perform out of bounds memory access via a crafted HTML page.(CVE-2021-30547)\r\n\r\ncrossbeam-deque is a package of work-stealing deques for building task schedulers when programming in Rust. In versions prior to 0.7.4 and 0.8.0, the result of the race condition is that one or more tasks in the worker queue can be popped twice instead of other tasks that are forgotten and never popped. If tasks are allocated on the heap, this can cause double free and a memory leak. If not, this still can cause a logical bug. Crates using `Stealer::steal`, `Stealer::steal_batch`, or `Stealer::steal_batch_and_pop` are affected by this issue. This has been fixed in crossbeam-deque 0.8.1 and 0.7.4.(CVE-2021-32810)\r\n\r\nMixed-content checks were unable to analyze opaque origins which led to some mixed content being loaded. This vulnerability affects Firefox &lt; 92.(CVE-2021-38491)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 91 and Firefox ESR 78.13. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox ESR &lt; 78.14, Thunderbird &lt; 78.14, and Firefox &lt; 92.(CVE-2021-38493)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 91. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 92.(CVE-2021-38494)\r\n\r\nDuring operations on MessageTasks, a task may have been removed while it was still scheduled, resulting in memory corruption and a potentially exploitable crash. This vulnerability affects Thunderbird &lt; 78.15, Thunderbird &lt; 91.2, Firefox ESR &lt; 91.2, Firefox ESR &lt; 78.15, and Firefox &lt; 93.(CVE-2021-38496)\r\n\r\nThrough use of reportValidity() and window.open(), a plain-text validation message could have been overlaid on another origin, leading to possible user confusion and spoofing attacks. This vulnerability affects Firefox &lt; 93, Thunderbird &lt; 91.2, and Firefox ESR &lt; 91.2.(CVE-2021-38497)\r\n\r\nDuring process shutdown, a document could have caused a use-after-free of a languages service object, leading to memory corruption and a potentially exploitable crash. This vulnerability affects Firefox &lt; 93, Thunderbird &lt; 91.2, and Firefox ESR &lt; 91.2.(CVE-2021-38498)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 92. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 93.(CVE-2021-38499)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 92 and Firefox ESR 91.1. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird &lt; 78.15, Thunderbird &lt; 91.2, Firefox ESR &lt; 91.2, Firefox ESR &lt; 78.15, and Firefox &lt; 93.(CVE-2021-38500)\r\n\r\nMozilla developers reported memory safety bugs present in Firefox 92 and Firefox ESR 91.1. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 93, Thunderbird &lt; 91.2, and Firefox ESR &lt; 91.2.(CVE-2021-38501)\r\n\r\nThe iframe sandbox rules were not correctly applied to XSLT stylesheets, allowing an iframe to bypass restrictions such as executing scripts or navigating the top-level frame. This vulnerability affects Firefox &lt; 94, Thunderbird &lt; 91.3, and Firefox ESR &lt; 91.3.(CVE-2021-38503)\r\n\r\nWhen interacting with an HTML input element&apos;s file picker dialog with webkitdirectory set, a use-after-free could have resulted, leading to memory corruption and a potentially exploitable crash. This vulnerability affects Firefox &lt; 94, Thunderbird &lt; 91.3, and Firefox ESR &lt; 91.3.(CVE-2021-38504)\r\n\r\nThrough a series of navigations, Firefox could have entered fullscreen mode without notification or warning to the user. This could lead to spoofing attacks on the browser UI including phishing. This vulnerability affects Firefox &lt; 94, Thunderbird &lt; 91.3, and Firefox ESR &lt; 91.3.(CVE-2021-38506)\r\n\r\nThe Opportunistic Encryption feature of HTTP2 (RFC 8164) allows a connection to be transparently upgraded to TLS while retaining the visual properties of an HTTP connection, including being same-origin with unencrypted connections on port 80. However, if a second encrypted port on the same IP address (e.g. port 8443) did not opt-in to opportunistic encryption; a network attacker could forward a connection from the browser to port 443 to port 8443, causing the browser to treat the content of port 8443 as same-origin with HTTP. This was resolved by disabling the Opportunistic Encryption feature, which had low usage. This vulnerability affects Firefox &lt; 94, Thunderbird &lt; 91.3, and Firefox ESR &lt; 91.3.(CVE-2021-38507)\r\n\r\nBy displaying a form validity message in the correct location at the same time as a permission prompt (such as for geolocation), the validity message could have obscured the prompt, resulting in the user potentially being tricked into granting the permission. This vulnerability affects Firefox &lt; 94, Thunderbird &lt; 91.3, and Firefox ESR &lt; 91.3.(CVE-2021-38508)\r\n\r\nDue to an unusual sequence of attacker-controlled events, a Javascript alert() dialog with arbitrary (although unstyled) contents could be displayed over top an uncontrolled webpage of the attacker&apos;s choosing. This vulnerability affects Firefox &lt; 94, Thunderbird &lt; 91.3, and Firefox ESR &lt; 91.3.(CVE-2021-38509)\r\n\r\nThe executable file warning was not presented when downloading .inetloc files, which, due to a flaw in Mac OS, can run commands on a user&apos;s computer.*Note: This issue only affected Mac OS operating systems. Other operating systems are unaffected.*. This vulnerability affects Firefox &lt; 94, Thunderbird &lt; 91.3, and Firefox ESR &lt; 91.3.(CVE-2021-38510)\r\n\r\nIt was possible to construct specific XSLT markup that would be able to bypass an iframe sandbox. This vulnerability affects Firefox ESR &lt; 91.5, Firefox &lt; 96, and Thunderbird &lt; 91.5.(CVE-2021-4140)\r\n\r\nWhen a user loaded a Web Extensions context menu, the Web Extension could access the post-redirect URL of the element clicked. If the Web Extension lacked the WebRequest permission for the hosts involved in the redirect, this would be a same-origin-violation leaking data the Web Extension should have access to. This was fixed to provide the pre-redirect URL. This is related to CVE-2021-43532 but in the context of Web Extensions. This vulnerability affects Firefox &lt; 94.(CVE-2021-43531)\r\n\r\nThe &apos;Copy Image Link&apos; context menu action would copy the final image URL after redirects. By embedding an image that triggered authentication flows - in conjunction with a Content Security Policy that stopped a redirection chain in the middle - the final image URL could be one that contained an authentication token used to takeover a user account. If a website tricked a user into copy and pasting the image link back to the page, the page would be able to steal the authentication tokens. This was fixed by making the action return the original URL, before any redirects. This vulnerability affects Firefox &lt; 94.(CVE-2021-43532)\r\n\r\nWhen parsing internationalized domain names, high bits of the characters in the URLs were sometimes stripped, resulting in inconsistencies that could lead to user confusion or attacks such as phishing. This vulnerability affects Firefox &lt; 94.(CVE-2021-43533)\r\n\r\nMozilla developers and community members reported memory safety bugs present in Firefox 93 and Firefox ESR 91.2. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 94, Thunderbird &lt; 91.3, and Firefox ESR &lt; 91.3.(CVE-2021-43534)\r\n\r\nA use-after-free could have occured when an HTTP2 session object was released on a different thread, leading to memory corruption and a potentially exploitable crash. This vulnerability affects Firefox &lt; 93, Thunderbird &lt; 91.3, and Firefox ESR &lt; 91.3.(CVE-2021-43535)\r\n\r\nUnder certain circumstances, asynchronous functions could have caused a navigation to fail but expose the target URL. This vulnerability affects Thunderbird &lt; 91.4.0, Firefox ESR &lt; 91.4.0, and Firefox &lt; 95.(CVE-2021-43536)\r\n\r\nAn incorrect type conversion of sizes from 64bit to 32bit integers allowed an attacker to corrupt memory leading to a potentially exploitable crash. This vulnerability affects Thunderbird &lt; 91.4.0, Firefox ESR &lt; 91.4.0, and Firefox &lt; 95.(CVE-2021-43537)\r\n\r\nBy misusing a race in our notification code, an attacker could have forcefully hidden the notification for pages that had received full screen and pointer lock access, which could have been used for spoofing attacks. This vulnerability affects Thunderbird &lt; 91.4.0, Firefox ESR &lt; 91.4.0, and Firefox &lt; 95.(CVE-2021-43538)\r\n\r\nFailure to correctly record the location of live pointers across wasm instance calls resulted in a GC occurring within the call not tracing those live pointers. This could have led to a use-after-free causing a potentially exploitable crash. This vulnerability affects Thunderbird &lt; 91.4.0, Firefox ESR &lt; 91.4.0, and Firefox &lt; 95.(CVE-2021-43539)\r\n\r\nWebExtensions with the correct permissions were able to create and install ServiceWorkers for third-party websites that would not have been uninstalled with the extension. This vulnerability affects Firefox &lt; 95.(CVE-2021-43540)\r\n\r\nWhen invoking protocol handlers for external protocols, a supplied parameter URL containing spaces was not properly escaped. This vulnerability affects Thunderbird &lt; 91.4.0, Firefox ESR &lt; 91.4.0, and Firefox &lt; 95.(CVE-2021-43541)\r\n\r\nUsing XMLHttpRequest, an attacker could have identified installed applications by probing error messages for loading external protocols. This vulnerability affects Thunderbird &lt; 91.4.0, Firefox ESR &lt; 91.4.0, and Firefox &lt; 95.(CVE-2021-43542)\r\n\r\nDocuments loaded with the CSP sandbox directive could have escaped the sandbox&apos;s script restriction by embedding additional content. This vulnerability affects Thunderbird &lt; 91.4.0, Firefox ESR &lt; 91.4.0, and Firefox &lt; 95.(CVE-2021-43543)\r\n\r\nUsing the Location API in a loop could have caused severe application hangs and crashes. This vulnerability affects Thunderbird &lt; 91.4.0, Firefox ESR &lt; 91.4.0, and Firefox &lt; 95.(CVE-2021-43545)\r\n\r\nIt was possible to recreate previous cursor spoofing attacks against users with a zoomed native cursor. This vulnerability affects Thunderbird &lt; 91.4.0, Firefox ESR &lt; 91.4.0, and Firefox &lt; 95.(CVE-2021-43546)\r\n\r\nMozilla developers and community members Gabriele Svelto, Sebastian Hengst, Randell Jesup, Luan Herrera, Lars T Hansen, and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 96. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 97.(CVE-2022-0511)\r\n\r\nMozilla developers Kershaw Chang, Ryan VanderMeulen, and Randell Jesup reported memory safety bugs present in Firefox 97. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 98.(CVE-2022-0843)\r\n\r\n&lt;code&gt;NSSToken&lt;/code&gt; objects were referenced via direct points, and could have been accessed in an unsafe way on different threads, leading to a use-after-free and potentially exploitable crash. This vulnerability affects Thunderbird &lt; 91.8, Firefox &lt; 99, and Firefox ESR &lt; 91.8.(CVE-2022-1097)\r\n\r\nAfter a VR Process is destroyed, a reference to it may have been retained and used, leading to a use-after-free and potentially exploitable crash. This vulnerability affects Thunderbird &lt; 91.8 and Firefox ESR &lt; 91.8.(CVE-2022-1196)\r\n\r\nAn attacker could have sent a message to the parent process where the contents were used to double-index into a JavaScript object, leading to prototype pollution and ultimately attacker-controlled JavaScript executing in the privileged parent process. This vulnerability affects Firefox ESR &lt; 91.9.1, Firefox &lt; 100.0.2, Firefox for Android &lt; 100.3.0, and Thunderbird &lt; 91.9.1.(CVE-2022-1529)\r\n\r\nIf an attacker was able to corrupt the methods of an Array object in JavaScript via prototype pollution, they could have achieved execution of attacker-controlled JavaScript code in a privileged context. This vulnerability affects Firefox ESR &lt; 91.9.1, Firefox &lt; 100.0.2, Firefox for Android &lt; 100.3.0, and Thunderbird &lt; 91.9.1.(CVE-2022-1802)\r\n\r\nUse after free in Codecs in Google Chrome prior to 101.0.4951.41 allowed a remote attacker to potentially exploit heap corruption via a crafted HTML page.(CVE-2022-1919)\r\n\r\nIf an object prototype was corrupted by an attacker, they would have been able to set undesired attributes on a JavaScript object, leading to privileged code execution. This vulnerability affects Firefox &lt; 102, Firefox ESR &lt; 91.11, Thunderbird &lt; 102, and Thunderbird &lt; 91.11.(CVE-2022-2200)\r\n\r\nConstructing audio sinks could have lead to a race condition when playing audio files and closing windows. This could have lead to a use-after-free causing a potentially exploitable crash. This vulnerability affects Firefox ESR &lt; 91.5, Firefox &lt; 96, and Thunderbird &lt; 91.5.(CVE-2022-22737)\r\n\r\nApplying a CSS filter effect could have accessed out of bounds memory. This could have lead to a heap-buffer-overflow causing a potentially exploitable crash. This vulnerability affects Firefox ESR &lt; 91.5, Firefox &lt; 96, and Thunderbird &lt; 91.5.(CVE-2022-22738)\r\n\r\nMalicious websites could have tricked users into accepting launching a program to handle an external URL protocol. This vulnerability affects Firefox ESR &lt; 91.5, Firefox &lt; 96, and Thunderbird &lt; 91.5.(CVE-2022-22739)\r\n\r\nCertain network request objects were freed too early when releasing a network request handle. This could have lead to a use-after-free causing a potentially exploitable crash. This vulnerability affects Firefox ESR &lt; 91.5, Firefox &lt; 96, and Thunderbird &lt; 91.5.(CVE-2022-22740)\r\n\r\nWhen resizing a popup while requesting fullscreen access, the popup would have become unable to leave fullscreen mode. This vulnerability affects Firefox ESR &lt; 91.5, Firefox &lt; 96, and Thunderbird &lt; 91.5.(CVE-2022-22741)\r\n\r\nWhen inserting text while in edit mode, some characters might have lead to out-of-bounds memory access causing a potentially exploitable crash. This vulnerability affects Firefox ESR &lt; 91.5, Firefox &lt; 96, and Thunderbird &lt; 91.5.(CVE-2022-22742)\r\n\r\nWhen navigating from inside an iframe while requesting fullscreen access, an attacker-controlled tab could have made the browser unable to leave fullscreen mode. This vulnerability affects Firefox ESR &lt; 91.5, Firefox &lt; 96, and Thunderbird &lt; 91.5.(CVE-2022-22743)\r\n\r\nSecuritypolicyviolation events could have leaked cross-origin information for frame-ancestors violations. This vulnerability affects Firefox ESR &lt; 91.5, Firefox &lt; 96, and Thunderbird &lt; 91.5.(CVE-2022-22745)\r\n\r\nAfter accepting an untrusted certificate, handling an empty pkcs7 sequence as part of the certificate data could have lead to a crash. This crash is believed to be unexploitable. This vulnerability affects Firefox ESR &lt; 91.5, Firefox &lt; 96, and Thunderbird &lt; 91.5.(CVE-2022-22747)\r\n\r\nMalicious websites could have confused Firefox into showing the wrong origin when asking to launch a program and handling an external URL protocol. This vulnerability affects Firefox ESR &lt; 91.5, Firefox &lt; 96, and Thunderbird &lt; 91.5.(CVE-2022-22748)\r\n\r\nIf a user installed an extension of a particular type, the extension could have auto-updated itself and while doing so, bypass the prompt which grants the new version the new requested permissions. This vulnerability affects Firefox &lt; 97, Thunderbird &lt; 91.6, and Firefox ESR &lt; 91.6.(CVE-2022-22754)\r\n\r\nBy using XSL Transforms, a malicious webserver could have served a user an XSL document that would continue to execute JavaScript (within the bounds of the same-origin policy) even after the tab was closed. This vulnerability affects Firefox &lt; 97.(CVE-2022-22755)\r\n\r\nIf a user was convinced to drag and drop an image to their desktop or other folder, the resulting object could have been changed into an executable script which would have run arbitrary code after the user clicked on it. This vulnerability affects Firefox &lt; 97, Thunderbird &lt; 91.6, and Firefox ESR &lt; 91.6.(CVE-2022-22756)\r\n\r\nRemote Agent, used in WebDriver, did not validate the Host or Origin headers. This could have allowed websites to connect back locally to the user&apos;s browser to control it. &lt;br&gt;*This bug only affected Firefox when WebDriver was enabled, which is not the default configuration.*. This vulnerability affects Firefox &lt; 97.(CVE-2022-22757)\r\n\r\nIf a document created a sandboxed iframe without &lt;code&gt;allow-scripts&lt;/code&gt;, and subsequently appended an element to the iframe&apos;s document that e.g. had a JavaScript event handler - the event handler would have run despite the iframe&apos;s sandbox. This vulnerability affects Firefox &lt; 97, Thunderbird &lt; 91.6, and Firefox ESR &lt; 91.6.(CVE-2022-22759)\r\n\r\nWhen importing resources using Web Workers, error messages would distinguish the difference between &lt;code&gt;application/javascript&lt;/code&gt; responses and non-script responses. This could have been abused to learn information cross-origin. This vulnerability affects Firefox &lt; 97, Thunderbird &lt; 91.6, and Firefox ESR &lt; 91.6.(CVE-2022-22760)\r\n\r\nWeb-accessible extension pages (pages with a moz-extension:// scheme) were not correctly enforcing the frame-ancestors directive when it was used in the Web Extension&apos;s Content Security Policy. This vulnerability affects Firefox &lt; 97, Thunderbird &lt; 91.6, and Firefox ESR &lt; 91.6.(CVE-2022-22761)\r\n\r\nWhen a worker is shutdown, it was possible to cause script to run late in the lifecycle, at a point after where it should not be possible. This vulnerability affects Firefox &lt; 96, Thunderbird &lt; 91.6, and Firefox ESR &lt; 91.6.(CVE-2022-22763)\r\n\r\nregex is an implementation of regular expressions for the Rust language. The regex crate features built-in mitigations to prevent denial of service attacks caused by untrusted regexes, or untrusted input matched by trusted regexes. Those (tunable) mitigations already provide sane defaults to prevent attacks. This guarantee is documented and it&apos;s considered part of the crate&apos;s API. Unfortunately a bug was discovered in the mitigations designed to prevent untrusted regexes to take an arbitrary amount of time during parsing, and it&apos;s possible to craft regexes that bypass such mitigations. This makes it possible to perform denial of service attacks by sending specially crafted regexes to services accepting user-controlled, untrusted regexes. All versions of the regex crate before or equal to 1.5.4 are affected by this issue. The fix is include starting from regex 1.5.5. All users accepting user-controlled regexes are recommended to upgrade immediately to the latest version of the regex crate. Unfortunately there is no fixed set of problematic regexes, as there are practically infinite regexes that could be crafted to exploit this vulnerability. Because of this, it us not recommend to deny known problematic regexes.(CVE-2022-24713)\r\n\r\nAn attacker could have caused a use-after-free by forcing a text reflow in an SVG object leading to a potentially exploitable crash. This vulnerability affects Firefox &lt; 98, Firefox ESR &lt; 91.7, and Thunderbird &lt; 91.7.(CVE-2022-26381)\r\n\r\nWhile the text displayed in Autofill tooltips cannot be directly read by JavaScript, the text was rendered using page fonts. Side-channel attacks on the text by using specially crafted fonts could have lead to this text being inferred by the webpage. This vulnerability affects Firefox &lt; 98.(CVE-2022-26382)\r\n\r\nWhen resizing a popup after requesting fullscreen access, the popup would not display the fullscreen notification. This vulnerability affects Firefox &lt; 98, Firefox ESR &lt; 91.7, and Thunderbird &lt; 91.7.(CVE-2022-26383)\r\n\r\nIf an attacker could control the contents of an iframe sandboxed with &lt;code&gt;allow-popups&lt;/code&gt; but not &lt;code&gt;allow-scripts&lt;/code&gt;, they were able to craft a link that, when clicked, would lead to JavaScript execution in violation of the sandbox. This vulnerability affects Firefox &lt; 98, Firefox ESR &lt; 91.7, and Thunderbird &lt; 91.7.(CVE-2022-26384)\r\n\r\nIn unusual circumstances, an individual thread may outlive the thread&apos;s manager during shutdown. This could have led to a use-after-free causing a potentially exploitable crash. This vulnerability affects Firefox &lt; 98.(CVE-2022-26385)\r\n\r\nPreviously Firefox for macOS and Linux would download temporary files to a user-specific directory in &lt;code&gt;/tmp&lt;/code&gt;, but this behavior was changed to download them to &lt;code&gt;/tmp&lt;/code&gt; where they could be affected by other local users. This behavior was reverted to the original, user-specific directory. &lt;br&gt;*This bug only affects Firefox for macOS and Linux. Other operating systems are unaffected.*. This vulnerability affects Firefox ESR &lt; 91.7 and Thunderbird &lt; 91.7.(CVE-2022-26386)\r\n\r\nWhen installing an add-on, Firefox verified the signature before prompting the user; but while the user was confirming the prompt, the underlying add-on file could have been modified and Firefox would not have noticed. This vulnerability affects Firefox &lt; 98, Firefox ESR &lt; 91.7, and Thunderbird &lt; 91.7.(CVE-2022-26387)\r\n\r\nRemoving an XSLT parameter during processing could have lead to an exploitable use-after-free. We have had reports of attacks in the wild abusing this flaw. This vulnerability affects Firefox &lt; 97.0.2, Firefox ESR &lt; 91.6.1, Firefox for Android &lt; 97.3.0, Thunderbird &lt; 91.6.2, and Focus &lt; 97.3.0.(CVE-2022-26485)\r\n\r\nAn unexpected message in the WebGPU IPC framework could lead to a use-after-free and exploitable sandbox escape. We have had reports of attacks in the wild abusing this flaw. This vulnerability affects Firefox &lt; 97.0.2, Firefox ESR &lt; 91.6.1, Firefox for Android &lt; 97.3.0, Thunderbird &lt; 91.6.2, and Focus &lt; 97.3.0.(CVE-2022-26486)\r\n\r\nIf a compromised content process sent an unexpected number of WebAuthN Extensions in a Register command to the parent process, an out of bounds write would have occurred leading to memory corruption and a potentially exploitable crash. This vulnerability affects Thunderbird &lt; 91.8, Firefox &lt; 99, and Firefox ESR &lt; 91.8.(CVE-2022-28281)\r\n\r\nBy using a link with &lt;code&gt;rel=&quot;localization&quot;&lt;/code&gt; a use-after-free could have been triggered by destroying an object during JavaScript execution and then referencing the object through a freed pointer, leading to a potential exploitable crash. This vulnerability affects Thunderbird &lt; 91.8, Firefox &lt; 99, and Firefox ESR &lt; 91.8.(CVE-2022-28282)\r\n\r\nThe sourceMapURL feature in devtools was missing security checks that would have allowed a webpage to attempt to include local files or other files that should have been inaccessible. This vulnerability affects Firefox &lt; 99.(CVE-2022-28283)\r\n\r\nSVG&apos;s &lt;code&gt;&amp;lt;use&amp;gt;&lt;/code&gt; element could have been used to load unexpected content that could have executed script in certain circumstances. While the specification seems to allow this, other browsers do not, and web developers relied on this property for script security so gecko&apos;s implementation was aligned with theirs. This vulnerability affects Firefox &lt; 99.(CVE-2022-28284)\r\n\r\nWhen generating the assembly code for &lt;code&gt;MLoadTypedArrayElementHole&lt;/code&gt;, an incorrect AliasSet was used. In conjunction with another vulnerability this could have been used for an out of bounds memory read. This vulnerability affects Thunderbird &lt; 91.8, Firefox &lt; 99, and Firefox ESR &lt; 91.8.(CVE-2022-28285)\r\n\r\nDue to a layout change, iframe contents could have been rendered outside of its border. This could have led to user confusion or spoofing attacks. This vulnerability affects Thunderbird &lt; 91.8, Firefox &lt; 99, and Firefox ESR &lt; 91.8.(CVE-2022-28286)\r\n\r\nIn unusual circumstances, selecting text could cause text selection caching to behave incorrectly, leading to a crash. This vulnerability affects Firefox &lt; 99.(CVE-2022-28287)\r\n\r\nMozilla developers and community members Nika Layzell, Andrew McCreight, Gabriele Svelto, and the Mozilla Fuzzing Team reported memory safety bugs present in Thunderbird 91.7. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird &lt; 91.8, Firefox &lt; 99, and Firefox ESR &lt; 91.8.(CVE-2022-28289)\r\n\r\nDocuments in deeply-nested cross-origin browsing contexts could have obtained permissions granted to the top-level origin, bypassing the existing prompt and wrongfully inheriting the top-level permissions. This vulnerability affects Thunderbird &lt; 91.9, Firefox ESR &lt; 91.9, and Firefox &lt; 100.(CVE-2022-29909)\r\n\r\nAn improper implementation of the new iframe sandbox keyword &lt;code&gt;allow-top-navigation-by-user-activation&lt;/code&gt; could lead to script execution without &lt;code&gt;allow-scripts&lt;/code&gt; being present. This vulnerability affects Thunderbird &lt; 91.9, Firefox ESR &lt; 91.9, and Firefox &lt; 100.(CVE-2022-29911)\r\n\r\nRequests initiated through reader mode did not properly omit cookies with a SameSite attribute. This vulnerability affects Thunderbird &lt; 91.9, Firefox ESR &lt; 91.9, and Firefox &lt; 100.(CVE-2022-29912)\r\n\r\nWhen reusing existing popups Firefox would have allowed them to cover the fullscreen notification UI, which could have enabled browser spoofing attacks. This vulnerability affects Thunderbird &lt; 91.9, Firefox ESR &lt; 91.9, and Firefox &lt; 100.(CVE-2022-29914)\r\n\r\nThe Performance API did not properly hide the fact whether a request cross-origin resource has observed redirects. This vulnerability affects Firefox &lt; 100.(CVE-2022-29915)\r\n\r\nFirefox behaved slightly differently for already known resources when loading CSS resources involving CSS variables. This could have been used to probe the browser history. This vulnerability affects Thunderbird &lt; 91.9, Firefox ESR &lt; 91.9, and Firefox &lt; 100.(CVE-2022-29916)\r\n\r\nMozilla developers Gabriele Svelto, Randell Jesup and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 99. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 100.(CVE-2022-29918)\r\n\r\nA malicious website could have learned the size of a cross-origin resource that supported Range requests. This vulnerability affects Thunderbird &lt; 91.10, Firefox &lt; 101, and Firefox ESR &lt; 91.10.(CVE-2022-31736)\r\n\r\nA malicious webpage could have caused an out-of-bounds write in WebGL, leading to memory corruption and a potentially exploitable crash. This vulnerability affects Thunderbird &lt; 91.10, Firefox &lt; 101, and Firefox ESR &lt; 91.10.(CVE-2022-31737)\r\n\r\nWhen exiting fullscreen mode, an iframe could have confused the browser about the current state of fullscreen, resulting in potential user confusion or spoofing attacks. This vulnerability affects Thunderbird &lt; 91.10, Firefox &lt; 101, and Firefox ESR &lt; 91.10.(CVE-2022-31738)\r\n\r\nOn arm64, WASM code could have resulted in incorrect assembly generation leading to a register allocation problem, and a potentially exploitable crash. This vulnerability affects Thunderbird &lt; 91.10, Firefox &lt; 101, and Firefox ESR &lt; 91.10.(CVE-2022-31740)\r\n\r\nA crafted CMS message could have been processed incorrectly, leading to an invalid memory read, and potentially further memory corruption. This vulnerability affects Thunderbird &lt; 91.10, Firefox &lt; 101, and Firefox ESR &lt; 91.10.(CVE-2022-31741)\r\n\r\nAn attacker could have exploited a timing attack by sending a large number of allowCredential entries and detecting the difference between invalid key handles and cross-origin key handles. This could have led to cross-origin account linking in violation of WebAuthn goals. This vulnerability affects Thunderbird &lt; 91.10, Firefox &lt; 101, and Firefox ESR &lt; 91.10.(CVE-2022-31742)\r\n\r\nFirefox&apos;s HTML parser did not correctly interpret HTML comment tags, resulting in an incongruity with other browsers. This could have been used to escape HTML comments on pages that put user-controlled data in them. This vulnerability affects Firefox &lt; 101.(CVE-2022-31743)\r\n\r\nAn attacker could have injected CSS into stylesheets accessible via internal URIs, such as resource:, and in doing so bypass a page&apos;s Content Security Policy. This vulnerability affects Firefox ESR &lt; 91.11, Thunderbird &lt; 102, Thunderbird &lt; 91.11, and Firefox &lt; 101.(CVE-2022-31744)\r\n\r\nIf array shift operations are not used, the Garbage Collector may have become confused about valid objects. This vulnerability affects Firefox &lt; 101.(CVE-2022-31745)\r\n\r\nMozilla developers Gabriele Svelto, Timothy Nikkel, Randell Jesup, Jon Coppeard, and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 100. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 101.(CVE-2022-31748)\r\n\r\nAn out-of-bounds read can occur when decoding H264 video. This results in a potentially exploitable crash. This vulnerability affects Firefox ESR &lt; 102.3, Thunderbird &lt; 102.3, and Firefox &lt; 105.(CVE-2022-3266)\r\n\r\nAn iframe that was not permitted to run scripts could do so if the user clicked on a &lt;code&gt;javascript:&lt;/code&gt; link. This vulnerability affects Firefox &lt; 102, Firefox ESR &lt; 91.11, Thunderbird &lt; 102, and Thunderbird &lt; 91.11.(CVE-2022-34468)\r\n\r\nWhen a TLS Certificate error occurs on a domain protected by the HSTS header, the browser should not allow the user to bypass the certificate error. On Firefox for Android, the user was presented with the option to bypass the error; this could only have been done by the user explicitly. &lt;br&gt;*This bug only affects Firefox for Android. Other operating systems are unaffected.*. This vulnerability affects Firefox &lt; 102.(CVE-2022-34469)\r\n\r\nSession history navigations may have led to a use-after-free and potentially exploitable crash. This vulnerability affects Firefox &lt; 102, Firefox ESR &lt; 91.11, Thunderbird &lt; 102, and Thunderbird &lt; 91.11.(CVE-2022-34470)\r\n\r\nWhen downloading an update for an addon, the downloaded addon update&apos;s version was not verified to match the version selected from the manifest. If the manifest had been tampered with on the server, an attacker could trick the browser into downgrading the addon to a prior version. This vulnerability affects Firefox &lt; 102.(CVE-2022-34471)\r\n\r\nIf there was a PAC URL set and the server that hosts the PAC was not reachable, OCSP requests would have been blocked, resulting in incorrect error pages being shown. This vulnerability affects Firefox &lt; 102, Firefox ESR &lt; 91.11, Thunderbird &lt; 102, and Thunderbird &lt; 91.11.(CVE-2022-34472)\r\n\r\nThe HTML Sanitizer should have sanitized the &lt;code&gt;href&lt;/code&gt; attribute of SVG &lt;code&gt;&amp;lt;use&amp;gt;&lt;/code&gt; tags; however it incorrectly did not sanitize &lt;code&gt;xlink:href&lt;/code&gt; attributes. This vulnerability affects Firefox &lt; 102.(CVE-2022-34473)\r\n\r\nEven when an iframe was sandboxed with &lt;code&gt;allow-top-navigation-by-user-activation&lt;/code&gt;, if it received a redirect header to an external protocol the browser would process the redirect and prompt the user as appropriate. This vulnerability affects Firefox &lt; 102.(CVE-2022-34474)\r\n\r\nSVG &lt;code&gt;&amp;lt;use&amp;gt;&lt;/code&gt; tags that referenced a same-origin document could have resulted in script execution if attacker input was sanitized via the HTML Sanitizer API. This would have required the attacker to reference a same-origin JavaScript file containing the script to be executed. This vulnerability affects Firefox &lt; 102.(CVE-2022-34475)\r\n\r\nASN.1 parsing of an indefinite SEQUENCE inside an indefinite GROUP could have resulted in the parser accepting malformed ASN.1. This vulnerability affects Firefox &lt; 102.(CVE-2022-34476)\r\n\r\nThe MediaError message property should be consistent to avoid leaking information about cross-origin resources; however for a same-site cross-origin resource, the message could have leaked information enabling XS-Leaks attacks. This vulnerability affects Firefox &lt; 102.(CVE-2022-34477)\r\n\r\nA malicious website that could create a popup could have resized the popup to overlay the address bar with its own content, resulting in potential user confusion or spoofing attacks. &lt;br&gt;*This bug only affects Thunderbird for Linux. Other operating systems are unaffected.*. This vulnerability affects Firefox &lt; 102, Firefox ESR &lt; 91.11, Thunderbird &lt; 102, and Thunderbird &lt; 91.11.(CVE-2022-34479)\r\n\r\nWithin the &lt;code&gt;lg_init()&lt;/code&gt; function, if several allocations succeed but then one fails, an uninitialized pointer would have been freed despite never being allocated. This vulnerability affects Firefox &lt; 102.(CVE-2022-34480)\r\n\r\nIn the &lt;code&gt;nsTArray_Impl::ReplaceElementsAt()&lt;/code&gt; function, an integer overflow could have occurred when the number of elements to replace was too large for the container. This vulnerability affects Firefox &lt; 102, Firefox ESR &lt; 91.11, Thunderbird &lt; 102, and Thunderbird &lt; 91.11.(CVE-2022-34481)\r\n\r\nAn attacker who could have convinced a user to drag and drop an image to a filesystem could have manipulated the resulting filename to contain an executable extension, and by extension potentially tricked the user into executing malicious code. While very similar, this is a separate issue from CVE-2022-34483. This vulnerability affects Firefox &lt; 102.(CVE-2022-34482)\r\n\r\nAn attacker who could have convinced a user to drag and drop an image to a filesystem could have manipulated the resulting filename to contain an executable extension, and by extension potentially tricked the user into executing malicious code. While very similar, this is a separate issue from CVE-2022-34482. This vulnerability affects Firefox &lt; 102.(CVE-2022-34483)\r\n\r\nThe Mozilla Fuzzing Team reported potential vulnerabilities present in Thunderbird 91.10. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 102, Firefox ESR &lt; 91.11, Thunderbird &lt; 102, and Thunderbird &lt; 91.11.(CVE-2022-34484)\r\n\r\nMozilla developers Bryce Seager van Dyk and the Mozilla Fuzzing Team reported potential vulnerabilities present in Firefox 101. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 102.(CVE-2022-34485)\r\n\r\nWhen visiting directory listings for `chrome://` URLs as source text, some parameters were reflected. This vulnerability affects Firefox ESR &lt; 102.1, Firefox ESR &lt; 91.12, Firefox &lt; 103, Thunderbird &lt; 102.1, and Thunderbird &lt; 91.12.(CVE-2022-36318)\r\n\r\nWhen combining CSS properties for overflow and transform, the mouse cursor could interact with different coordinates than displayed. This vulnerability affects Firefox ESR &lt; 102.1, Firefox ESR &lt; 91.12, Firefox &lt; 103, Thunderbird &lt; 102.1, and Thunderbird &lt; 91.12.(CVE-2022-36319)\r\n\r\nAn attacker could have abused XSLT error handling to associate attacker-controlled content with another origin which was displayed in the address bar. This could have been used to fool the user into submitting data intended for the spoofed origin. This vulnerability affects Thunderbird &lt; 102.2, Thunderbird &lt; 91.13, Firefox ESR &lt; 91.13, Firefox ESR &lt; 102.2, and Firefox &lt; 104.(CVE-2022-38472)\r\n\r\nA cross-origin iframe referencing an XSLT document would inherit the parent domain&apos;s permissions (such as microphone or camera access). This vulnerability affects Thunderbird &lt; 102.2, Thunderbird &lt; 91.13, Firefox ESR &lt; 91.13, Firefox ESR &lt; 102.2, and Firefox &lt; 104.(CVE-2022-38473)\r\n\r\nMozilla developer Nika Layzell and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 103 and Firefox ESR 102.1. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox ESR &lt; 102.2, Thunderbird &lt; 102.2, and Firefox &lt; 104.(CVE-2022-38477)\r\n\r\nMembers the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 103, Firefox ESR 102.1, and Firefox ESR 91.12. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird &lt; 102.2, Thunderbird &lt; 91.13, Firefox ESR &lt; 91.13, Firefox ESR &lt; 102.2, and Firefox &lt; 104.(CVE-2022-38478)\r\n\r\nWhen injecting an HTML base element, some requests would ignore the CSP&apos;s base-uri settings and accept the injected element&apos;s base instead. This vulnerability affects Firefox ESR &lt; 102.3, Thunderbird &lt; 102.3, and Firefox &lt; 105.(CVE-2022-40956)\r\n\r\nInconsistent data in instruction and data cache when creating wasm code could lead to a potentially exploitable crash.&lt;br&gt;*This bug only affects Firefox on ARM64 platforms.*. This vulnerability affects Firefox ESR &lt; 102.3, Thunderbird &lt; 102.3, and Firefox &lt; 105.(CVE-2022-40957)\r\n\r\nBy injecting a cookie with certain special characters, an attacker on a shared subdomain which is not a secure context could set and thus overwrite cookies from a secure context, leading to session fixation and other attacks. This vulnerability affects Firefox ESR &lt; 102.3, Thunderbird &lt; 102.3, and Firefox &lt; 105.(CVE-2022-40958)\r\n\r\nDuring iframe navigation, certain pages did not have their FeaturePolicy fully initialized leading to a bypass that leaked device permissions into untrusted subdocuments. This vulnerability affects Firefox ESR &lt; 102.3, Thunderbird &lt; 102.3, and Firefox &lt; 105.(CVE-2022-40959)\r\n\r\nConcurrent use of the URL parser with non-UTF-8 data was not thread-safe. This could lead to a use-after-free causing a potentially exploitable crash. This vulnerability affects Firefox ESR &lt; 102.3, Thunderbird &lt; 102.3, and Firefox &lt; 105.(CVE-2022-40960)\r\n\r\nMozilla developers Nika Layzell, Timothy Nikkel, Sebastian Hengst, Andreas Pehrson, and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 104 and Firefox ESR 102.2. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox ESR &lt; 102.3, Thunderbird &lt; 102.3, and Firefox &lt; 105.(CVE-2022-40962)\r\n\r\nCertain types of allocations were missing annotations that, if the Garbage Collector was in a specific state, could have lead to memory corruption and a potentially exploitable crash. This vulnerability affects Firefox &lt; 106, Firefox ESR &lt; 102.4, and Thunderbird &lt; 102.4.(CVE-2022-42928)\r\n\r\nThrough a series of popups that reuse windowName, an attacker can cause a window to go fullscreen without the user seeing the notification prompt, resulting in potential user confusion or spoofing attacks. This vulnerability affects Firefox ESR &lt; 102.5, Thunderbird &lt; 102.5, and Firefox &lt; 107.(CVE-2022-45408)\r\n\r\nThe garbage collector could have been aborted in several states and zones and &lt;code&gt;GCRuntime::finishCollection&lt;/code&gt; may not have been called, leading to a use-after-free and potentially exploitable crash. This vulnerability affects Firefox ESR &lt; 102.5, Thunderbird &lt; 102.5, and Firefox &lt; 107.(CVE-2022-45409)\r\n\r\nWhen a ServiceWorker intercepted a request with &lt;code&gt;FetchEvent&lt;/code&gt;, the origin of the request was lost after the ServiceWorker took ownership of it. This had the effect of negating SameSite cookie protections. This was addressed in the spec and then in browsers. This vulnerability affects Firefox ESR &lt; 102.5, Thunderbird &lt; 102.5, and Firefox &lt; 107.(CVE-2022-45410)\r\n\r\nCross-Site Tracing occurs when a server will echo a request back via the Trace method, allowing an XSS attack to access to authorization headers and cookies inaccessible to JavaScript (such as cookies protected by HTTPOnly). To mitigate this attack, browsers placed limits on &lt;code&gt;fetch()&lt;/code&gt; and XMLHttpRequest; however some webservers have implemented non-standard headers such as &lt;code&gt;X-Http-Method-Override&lt;/code&gt; that override the HTTP method, and made this attack possible again. Thunderbird has applied the same mitigations to the use of this and similar headers. This vulnerability affects Firefox ESR &lt; 102.5, Thunderbird &lt; 102.5, and Firefox &lt; 107.(CVE-2022-45411)\r\n\r\nWhen resolving a symlink such as &lt;code&gt;file:///proc/self/fd/1&lt;/code&gt;, an error message may be produced where the symlink was resolved to a string containing unitialized memory in the buffer. &lt;br&gt;*This bug only affects Thunderbird on Unix-based operated systems (Android, Linux, MacOS). Windows is unaffected.*. This vulnerability affects Firefox ESR &lt; 102.5, Thunderbird &lt; 102.5, and Firefox &lt; 107.(CVE-2022-45412)\r\n\r\nKeyboard events reference strings like &quot;KeyA&quot; that were at fixed, known, and widely-spread addresses. Cache-based timing attacks such as Prime+Probe could have possibly figured out which keys were being pressed. This vulnerability affects Firefox ESR &lt; 102.5, Thunderbird &lt; 102.5, and Firefox &lt; 107.(CVE-2022-45416)\r\n\r\nIf a custom mouse cursor is specified in CSS, under certain circumstances the cursor could have been drawn over the browser UI, resulting in potential user confusion or spoofing attacks. This vulnerability affects Firefox ESR &lt; 102.5, Thunderbird &lt; 102.5, and Firefox &lt; 107.(CVE-2022-45418)\r\n\r\nUse tables inside of an iframe, an attacker could have caused iframe contents to be rendered outside the boundaries of the iframe, resulting in potential user confusion or spoofing attacks. This vulnerability affects Firefox ESR &lt; 102.5, Thunderbird &lt; 102.5, and Firefox &lt; 107.(CVE-2022-45420)\r\n\r\nMozilla developers Andrew McCreight and Gabriele Svelto reported memory safety bugs present in Thunderbird 102.4. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox ESR &lt; 102.5, Thunderbird &lt; 102.5, and Firefox &lt; 107.(CVE-2022-45421)\r\n\r\nAn out of date library (libusrsctp) contained vulnerabilities that could potentially be exploited. This vulnerability affects Firefox &lt; 108.(CVE-2022-46871)\r\n\r\nA file with a long filename could have had its filename truncated to remove the valid extension, leaving a malicious extension in its place. This could potentially led to user confusion and the execution of malicious code.&lt;br/&gt;*Note*: This issue was originally included in the advisories for Thunderbird 102.6, but a patch (specific to Thunderbird) was omitted, resulting in it actually being fixed in Thunderbird 102.6.1. This vulnerability affects Firefox &lt; 108, Thunderbird &lt; 102.6.1, Thunderbird &lt; 102.6, and Firefox ESR &lt; 102.6.(CVE-2022-46874)\r\n\r\nThe executable file warning was not presented when downloading .atloc and .ftploc files, which can run commands on a user&apos;s computer. &lt;br&gt;*Note: This issue only affected Mac OS operating systems. Other operating systems are unaffected.*. This vulnerability affects Firefox &lt; 108, Firefox ESR &lt; 102.6, and Thunderbird &lt; 102.6.(CVE-2022-46875)\r\n\r\nMozilla developers Randell Jesup, Valentin Gosu, Olli Pettay, and the Mozilla Fuzzing Team reported memory safety bugs present in Thunderbird 102.5. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 108, Firefox ESR &lt; 102.6, and Thunderbird &lt; 102.6.(CVE-2022-46878)\r\n\r\nA use-after-free in WebGL extensions could have led to a potentially exploitable crash. This vulnerability affects Firefox &lt; 107, Firefox ESR &lt; 102.6, and Thunderbird &lt; 102.6.(CVE-2022-46882)\r\n\r\nAn attacker could construct a PKCS 12 cert bundle in such a way that could allow for arbitrary memory writes via PKCS 12 Safe Bag attributes being mishandled. This vulnerability affects Firefox &lt; 110, Thunderbird &lt; 102.8, and Firefox ESR &lt; 102.8.(CVE-2023-0767)\r\n\r\nUnexpected data returned from the Safe Browsing API could have led to memory corruption and a potentially exploitable crash. This vulnerability affects Thunderbird &lt; 102.10 and Firefox ESR &lt; 102.10.(CVE-2023-1945)\r\n\r\nDue to the Firefox GTK wrapper code&apos;s use of text/plain for drag data and GTK treating all text/plain MIMEs containing file URLs as being dragged a website could arbitrarily read a file via a call to &lt;code&gt;DataTransfer.setData&lt;/code&gt;. This vulnerability affects Firefox &lt; 109, Thunderbird &lt; 102.7, and Firefox ESR &lt; 102.7.(CVE-2023-23598)\r\n\r\nWhen copying a network request from the developer tools panel as a curl command the output was not being properly sanitized and could allow arbitrary commands to be hidden within. This vulnerability affects Firefox &lt; 109, Thunderbird &lt; 102.7, and Firefox ESR &lt; 102.7.(CVE-2023-23599)\r\n\r\nNavigations were being allowed when dragging a URL from a cross-origin iframe into the same tab which could lead to website spoofing attacks. This vulnerability affects Firefox &lt; 109, Thunderbird &lt; 102.7, and Firefox ESR &lt; 102.7.(CVE-2023-23601)\r\n\r\nA mishandled security check when creating a WebSocket in a WebWorker caused the Content Security Policy connect-src header to be ignored. This could lead to connections to restricted origins from inside WebWorkers. This vulnerability affects Firefox &lt; 109, Thunderbird &lt; 102.7, and Firefox ESR &lt; 102.7.(CVE-2023-23602)\r\n\r\nRegular expressions used to filter out forbidden properties and values from style directives in calls to &lt;code&gt;console.log&lt;/code&gt; weren&apos;t accounting for external URLs. Data could then be potentially exfiltrated from the browser. This vulnerability affects Firefox &lt; 109, Thunderbird &lt; 102.7, and Firefox ESR &lt; 102.7.(CVE-2023-23603)\r\n\r\nThe &lt;code&gt;Content-Security-Policy-Report-Only&lt;/code&gt; header could allow an attacker to leak a child iframe&apos;s unredacted URI when interaction with that iframe triggers a redirect. This vulnerability affects Firefox &lt; 110, Thunderbird &lt; 102.8, and Firefox ESR &lt; 102.8.(CVE-2023-25728)\r\n\r\nPermission prompts for opening external schemes were only shown for &lt;code&gt;ContentPrincipals&lt;/code&gt; resulting in extensions being able to open them without user interaction via &lt;code&gt;ExpandedPrincipals&lt;/code&gt;. This could lead to further malicious actions such as downloading files or interacting with software already installed on the system. This vulnerability affects Firefox &lt; 110, Thunderbird &lt; 102.8, and Firefox ESR &lt; 102.8.(CVE-2023-25729)\r\n\r\nA background script invoking &lt;code&gt;requestFullscreen&lt;/code&gt; and then blocking the main thread could force the browser into fullscreen mode indefinitely, resulting in potential user confusion or spoofing attacks. This vulnerability affects Firefox &lt; 110, Thunderbird &lt; 102.8, and Firefox ESR &lt; 102.8.(CVE-2023-25730)\r\n\r\nWhen encoding data from an &lt;code&gt;inputStream&lt;/code&gt; in &lt;code&gt;xpcom&lt;/code&gt; the size of the input being encoded was not correctly calculated potentially leading to an out of bounds memory write. This vulnerability affects Firefox &lt; 110, Thunderbird &lt; 102.8, and Firefox ESR &lt; 102.8.(CVE-2023-25732)\r\n\r\nCross-compartment wrappers wrapping a scripted proxy could have caused objects from other compartments to be stored in the main compartment resulting in a use-after-free after unwrapping the proxy. This vulnerability affects Firefox &lt; 110, Thunderbird &lt; 102.8, and Firefox ESR &lt; 102.8.(CVE-2023-25735)\r\n\r\nAn invalid downcast from &lt;code&gt;nsTextNode&lt;/code&gt; to &lt;code&gt;SVGElement&lt;/code&gt; could have lead to undefined behavior. This vulnerability affects Firefox &lt; 110, Thunderbird &lt; 102.8, and Firefox ESR &lt; 102.8.(CVE-2023-25737)\r\n\r\nModule load requests that failed were not being checked as to whether or not they were cancelled causing a use-after-free in &lt;code&gt;ScriptLoadContext&lt;/code&gt;. This vulnerability affects Firefox &lt; 110, Thunderbird &lt; 102.8, and Firefox ESR &lt; 102.8.(CVE-2023-25739)\r\n\r\nWhen importing a SPKI RSA public key as ECDSA P-256, the key would be handled incorrectly causing the tab to crash. This vulnerability affects Firefox &lt; 110, Thunderbird &lt; 102.8, and Firefox ESR &lt; 102.8.(CVE-2023-25742)\r\n\r\nSometimes, when invalidating JIT code while following an iterator, the newly generated code could be overwritten incorrectly. This could lead to a potentially exploitable crash. This vulnerability affects Firefox &lt; 111, Firefox ESR &lt; 102.9, and Thunderbird &lt; 102.9.(CVE-2023-25751)\r\n\r\nWhen accessing throttled streams, the count of available bytes needed to be checked in the calling function to be within bounds. This may have lead future code to be incorrect and vulnerable. This vulnerability affects Firefox &lt; 111, Firefox ESR &lt; 102.9, and Thunderbird &lt; 102.9.(CVE-2023-25752)\r\n\r\nWhile implementing AudioWorklets, some code may have casted one type to another, invalid, dynamic type. This could have led to a potentially exploitable crash. This vulnerability affects Firefox &lt; 111, Firefox ESR &lt; 102.9, and Thunderbird &lt; 102.9.(CVE-2023-28162)\r\n\r\nDragging a URL from a cross-origin iframe that was removed during the drag could have led to user confusion and website spoofing attacks. This vulnerability affects Firefox &lt; 111, Firefox ESR &lt; 102.9, and Thunderbird &lt; 102.9.(CVE-2023-28164)\r\n\r\nMozilla developers Timothy Nikkel, Andrew McCreight, and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 110 and Firefox ESR 102.8. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 111, Firefox ESR &lt; 102.9, and Thunderbird &lt; 102.9.(CVE-2023-28176)\r\n\r\nA website could have obscured the fullscreen notification by using a combination of &lt;code&gt;window.open&lt;/code&gt;, fullscreen requests, &lt;code&gt;window.name&lt;/code&gt; assignments, and &lt;code&gt;setInterval&lt;/code&gt; calls. This could have led to user confusion and possible spoofing attacks. This vulnerability affects Firefox &lt; 112, Focus for Android &lt; 112, Firefox ESR &lt; 102.10, Firefox for Android &lt; 112, and Thunderbird &lt; 102.10.(CVE-2023-29533)\r\n\r\nFollowing a Garbage Collector compaction, weak maps may have been accessed before they were correctly traced. This resulted in memory corruption and a potentially exploitable crash. This vulnerability affects Firefox &lt; 112, Focus for Android &lt; 112, Firefox ESR &lt; 102.10, Firefox for Android &lt; 112, and Thunderbird &lt; 102.10.(CVE-2023-29535)\r\n\r\nAn attacker could cause the memory manager to incorrectly free a pointer that addresses attacker-controlled memory, resulting in an assertion, memory corruption, or a potentially exploitable crash. This vulnerability affects Firefox &lt; 112, Focus for Android &lt; 112, Firefox ESR &lt; 102.10, Firefox for Android &lt; 112, and Thunderbird &lt; 102.10.(CVE-2023-29536)\r\n\r\nWhen handling the filename directive in the Content-Disposition header, the filename would be truncated if the filename contained a NULL character. This could have led to reflected file download attacks potentially tricking users to install malware. This vulnerability affects Firefox &lt; 112, Focus for Android &lt; 112, Firefox ESR &lt; 102.10, Firefox for Android &lt; 112, and Thunderbird &lt; 102.10.(CVE-2023-29539)\r\n\r\nFirefox did not properly handle downloads of files ending in &lt;code&gt;.desktop&lt;/code&gt;, which can be interpreted to run attacker-controlled commands. &lt;br&gt;*This bug only affects Firefox for Linux on certain Distributions. Other operating systems are unaffected, and Mozilla is unable to enumerate all affected Linux Distributions.*. This vulnerability affects Firefox &lt; 112, Focus for Android &lt; 112, Firefox ESR &lt; 102.10, Firefox for Android &lt; 112, and Thunderbird &lt; 102.10.(CVE-2023-29541)\r\n\r\nA wrong lowering instruction in the ARM64 Ion compiler resulted in a wrong optimization result. This vulnerability affects Firefox &lt; 112, Focus for Android &lt; 112, Firefox ESR &lt; 102.10, Firefox for Android &lt; 112, and Thunderbird &lt; 102.10.(CVE-2023-29548)\r\n\r\nMozilla developers Randell Jesup, Andrew Osmond, Sebastian Hengst, Andrew McCreight, and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 111 and Firefox ESR 102.9. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 112, Focus for Android &lt; 112, Firefox ESR &lt; 102.10, Firefox for Android &lt; 112, and Thunderbird &lt; 102.10.(CVE-2023-29550)\r\n\r\nIn multiple cases browser prompts could have been obscured by popups controlled by content. These could have led to potential user confusion and spoofing attacks. This vulnerability affects Firefox &lt; 113, Firefox ESR &lt; 102.11, and Thunderbird &lt; 102.11.(CVE-2023-32205)\r\n\r\nAn out-of-bound read could have led to a crash in the RLBox Expat driver. This vulnerability affects Firefox &lt; 113, Firefox ESR &lt; 102.11, and Thunderbird &lt; 102.11.(CVE-2023-32206)\r\n\r\nA missing delay in popup notifications could have made it possible for an attacker to trick a user into granting permissions. This vulnerability affects Firefox &lt; 113, Firefox ESR &lt; 102.11, and Thunderbird &lt; 102.11.(CVE-2023-32207)\r\n\r\nA type checking bug would have led to invalid code being compiled. This vulnerability affects Firefox &lt; 113, Firefox ESR &lt; 102.11, and Thunderbird &lt; 102.11.(CVE-2023-32211)\r\n\r\nAn attacker could have positioned a &lt;code&gt;datalist&lt;/code&gt; element to obscure the address bar. This vulnerability affects Firefox &lt; 113, Firefox ESR &lt; 102.11, and Thunderbird &lt; 102.11.(CVE-2023-32212)\r\n\r\nWhen reading a file, an uninitialized value could have been used as read limit. This vulnerability affects Firefox &lt; 113, Firefox ESR &lt; 102.11, and Thunderbird &lt; 102.11.(CVE-2023-32213)\r\n\r\nMozilla developers and community members Gabriele Svelto, Andrew Osmond, Emily McDonough, Sebastian Hengst, Andrew McCreight and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 112 and Firefox ESR 102.10. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 113, Firefox ESR &lt; 102.11, and Thunderbird &lt; 102.11.(CVE-2023-32215)\r\n\r\nAn attacker could have triggered a use-after-free condition when creating a WebRTC connection over HTTPS. This vulnerability affects Firefox &lt; 115, Firefox ESR &lt; 102.13, and Thunderbird &lt; 102.13.(CVE-2023-37201)\r\n\r\nCross-compartment wrappers wrapping a scripted proxy could have caused objects from other compartments to be stored in the main compartment resulting in a use-after-free. This vulnerability affects Firefox &lt; 115, Firefox ESR &lt; 102.13, and Thunderbird &lt; 102.13.(CVE-2023-37202)\r\n\r\nA website could have obscured the fullscreen notification by using a URL with a scheme handled by an external program, such as a mailto URL. This could have led to user confusion and possible spoofing attacks. This vulnerability affects Firefox &lt; 115, Firefox ESR &lt; 102.13, and Thunderbird &lt; 102.13.(CVE-2023-37207)\r\n\r\nWhen opening Diagcab files, Firefox did not warn the user that these files may contain malicious code. This vulnerability affects Firefox &lt; 115, Firefox ESR &lt; 102.13, and Thunderbird &lt; 102.13.(CVE-2023-37208)\r\n\r\nMemory safety bugs present in Firefox 114, Firefox ESR 102.12, and Thunderbird 102.12. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 115, Firefox ESR &lt; 102.13, and Thunderbird &lt; 102.13.(CVE-2023-37211)\r\n\r\nOffscreen Canvas did not properly track cross-origin tainting, which could have been used to access image data from another site in violation of same-origin policy. This vulnerability affects Firefox &lt; 116, Firefox ESR &lt; 102.14, and Firefox ESR &lt; 115.1.(CVE-2023-4045)\r\n\r\nIn some circumstances, a stale value could have been used for a global variable in WASM JIT analysis. This resulted in incorrect compilation and a potentially exploitable crash in the content process. This vulnerability affects Firefox &lt; 116, Firefox ESR &lt; 102.14, and Firefox ESR &lt; 115.1.(CVE-2023-4046)\r\n\r\nA bug in popup notifications delay calculation could have made it possible for an attacker to trick a user into granting permissions. This vulnerability affects Firefox &lt; 116, Firefox ESR &lt; 102.14, and Firefox ESR &lt; 115.1.(CVE-2023-4047)\r\n\r\nAn out-of-bounds read could have led to an exploitable crash when parsing HTML with DOMParser in low memory situations. This vulnerability affects Firefox &lt; 116, Firefox ESR &lt; 102.14, and Firefox ESR &lt; 115.1.(CVE-2023-4048)\r\n\r\nRace conditions in reference counting code were found through code inspection. These could have resulted in potentially exploitable use-after-free vulnerabilities. This vulnerability affects Firefox &lt; 116, Firefox ESR &lt; 102.14, and Firefox ESR &lt; 115.1.(CVE-2023-4049)\r\n\r\nIn some cases, an untrusted input stream was copied to a stack buffer without checking its size. This resulted in a potentially exploitable crash which could have led to a sandbox escape. This vulnerability affects Firefox &lt; 116, Firefox ESR &lt; 102.14, and Firefox ESR &lt; 115.1.(CVE-2023-4050)\r\n\r\nWhen opening appref-ms files, Firefox did not warn the user that these files may contain malicious code. \n*This bug only affects Firefox on Windows. Other operating systems are unaffected.* This vulnerability affects Firefox &lt; 116, Firefox ESR &lt; 102.14, Firefox ESR &lt; 115.1, Thunderbird &lt; 102.14, and Thunderbird &lt; 115.1.(CVE-2023-4054)\r\n\r\nWhen the number of cookies per domain was exceeded in `document.cookie`, the actual cookie jar sent to the host was no longer consistent with expected cookie jar state. This could have caused requests to be sent with some cookies missing. This vulnerability affects Firefox &lt; 116, Firefox ESR &lt; 102.14, and Firefox ESR &lt; 115.1.(CVE-2023-4055)\r\n\r\nMemory safety bugs present in Firefox 115, Firefox ESR 115.0, Firefox ESR 102.13, Thunderbird 115.0, and Thunderbird 102.13. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox &lt; 116, Firefox ESR &lt; 102.14, and Firefox ESR &lt; 115.1.(CVE-2023-4056)","affected":[{"package":{"name":"firefox","ecosystem":"openEuler:22.03-LTS","purl":"pkg:rpm/openEuler/firefox&distro=openEuler-22.03-LTS"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"102.14.0-1.oe2203"}]}],"ecosystem_specific":{"aarch64":["firefox-debuginfo-102.14.0-1.oe2203.aarch64.rpm","firefox-102.14.0-1.oe2203.aarch64.rpm","firefox-debugsource-102.14.0-1.oe2203.aarch64.rpm"],"src":["firefox-102.14.0-1.oe2203.src.rpm"],"x86_64":["firefox-102.14.0-1.oe2203.x86_64.rpm","firefox-debugsource-102.14.0-1.oe2203.x86_64.rpm","firefox-debuginfo-102.14.0-1.oe2203.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2023-1673.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/en/security/safety-bulletin/detail.html?id=openEuler-SA-2023-1673"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-15670"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-15673"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-15674"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-15675"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-15680"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-15681"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-15682"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-15683"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-15684"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-16012"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-16044"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26950"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26951"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26953"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26956"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26958"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26959"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26960"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26961"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26962"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26965"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26968"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26969"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26971"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26972"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26973"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26974"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26976"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26978"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-26979"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-35111"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-35113"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2020-35114"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23953"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23954"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23955"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23956"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23958"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23960"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23961"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23962"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23963"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23964"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23965"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23968"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23969"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23970"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23971"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23972"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23973"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23974"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23975"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23978"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23979"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23981"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23982"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23983"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23984"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23985"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23986"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23987"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23988"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23994"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23995"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23996"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23997"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23998"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-23999"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-24000"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-24001"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-24002"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29944"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29945"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29946"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29947"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29952"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29953"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29955"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29959"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29960"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29961"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29965"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29966"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29967"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29970"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29972"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29974"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29975"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29976"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29977"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29980"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29981"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29982"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29984"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29985"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29986"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29987"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29988"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29989"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29990"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-29991"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-30547"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-32810"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38491"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38493"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38494"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38496"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38497"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38498"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38499"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38500"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38501"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38503"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38504"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38506"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38507"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38508"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38509"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-38510"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-4140"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43531"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43532"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43533"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43534"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43535"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43536"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43537"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43538"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43539"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43540"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43541"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43542"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43543"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43545"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43546"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-0511"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-0843"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-1097"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-1196"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-1529"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-1802"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-1919"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-2200"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22737"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22738"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22739"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22740"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22741"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22742"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22743"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22745"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22747"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22748"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22754"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22755"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22756"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22757"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22759"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22760"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22761"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-22763"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-24713"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-26381"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-26382"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-26383"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-26384"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-26385"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-26386"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-26387"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-26485"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-26486"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-28281"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-28282"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-28283"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-28284"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-28285"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-28286"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-28287"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-28289"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-29909"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-29911"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-29912"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-29914"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-29915"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-29916"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-29918"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-31736"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-31737"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-31738"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-31740"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-31741"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-31742"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-31743"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-31744"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-31745"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-31748"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-3266"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34468"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34469"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34470"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34471"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34472"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34473"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34474"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34475"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34476"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34477"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34479"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34480"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34481"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34482"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34483"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34484"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-34485"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-36318"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-36319"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-38472"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-38473"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-38477"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-38478"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-40956"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-40957"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-40958"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-40959"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-40960"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-40962"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-42928"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-45408"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-45409"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-45410"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-45411"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-45412"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-45416"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-45418"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-45420"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-45421"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-46871"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-46874"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-46875"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-46878"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-46882"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-0767"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-1945"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-23598"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-23599"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-23601"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-23602"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-23603"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-25728"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-25729"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-25730"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-25732"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-25735"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-25737"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-25739"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-25742"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-25751"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-25752"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-28162"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-28164"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-28176"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-29533"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-29535"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-29536"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-29539"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-29541"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-29548"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-29550"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-32205"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-32206"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-32207"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-32211"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-32212"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-32213"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-32215"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-37201"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-37202"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-37207"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-37208"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-37211"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-4045"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-4046"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-4047"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-4048"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-4049"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-4050"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-4054"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-4055"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-4056"}],"database_specific":{"severity":"Critical"}}