{"schema_version":"1.7.3","id":"OESA-2022-2077","published":"2022-11-11T11:04:34Z","modified":"2025-09-03T06:18:01.670217Z","upstream":["CVE-2022-21702"],"summary":"grafana security update","details":"Grafana is an open source, feature rich metrics dashboard and graph editor for Graphite, InfluxDB and OpenTSDB.\r\n\r\nSecurity Fix(es):\r\n\r\nGrafana is an open-source platform for monitoring and observability. In affected versions an attacker could serve HTML content thru the Grafana datasource or plugin proxy and trick a user to visit this HTML page using a specially crafted link and execute a Cross-site Scripting (XSS) attack. The attacker could either compromise an existing datasource for a specific Grafana instance or either set up its own public service and instruct anyone to set it up in their Grafana instance. To be impacted, all of the following must be applicable. For the data source proxy: A Grafana HTTP-based datasource configured with Server as Access Mode and a URL set, the attacker has to be in control of the HTTP server serving the URL of above datasource, and a specially crafted link pointing at the attacker controlled data source must be clicked on by an authenticated user. For the plugin proxy: A Grafana HTTP-based app plugin configured and enabled with a URL set, the attacker has to be in control of the HTTP server serving the URL of above app, and a specially crafted link pointing at the attacker controlled plugin must be clocked on by an authenticated user. For the backend plugin resource: An attacker must be able to navigate an authenticated user to a compromised plugin through a crafted link. Users are advised to update to a patched version. There are no known workarounds for this vulnerability.(CVE-2022-21702)","affected":[{"package":{"name":"grafana","ecosystem":"openEuler:22.03-LTS","purl":"pkg:rpm/openEuler/grafana&distro=openEuler-22.03-LTS"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"7.5.15-3.oe2203"}]}],"ecosystem_specific":{"aarch64":["grafana-7.5.15-3.oe2203.aarch64.rpm","grafana-debuginfo-7.5.15-3.oe2203.aarch64.rpm"],"src":["grafana-7.5.15-3.oe2203.src.rpm"],"x86_64":["grafana-debuginfo-7.5.15-3.oe2203.x86_64.rpm","grafana-7.5.15-3.oe2203.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2022-2077.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/en/security/safety-bulletin/detail.html?id=openEuler-SA-2022-2077"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-21702"}],"database_specific":{"severity":"Medium"}}