{"schema_version":"1.7.3","id":"OESA-2022-2065","published":"2022-11-11T11:04:33Z","modified":"2025-09-03T06:17:38.745532Z","upstream":["CVE-2021-4104","CVE-2022-23302","CVE-2022-23307"],"summary":"log4j12 security update","details":"With log4j it is possible to enable logging at runtime without modifying the application binary.\r\n\r\nSecurity Fix(es):\r\n\r\nJMSAppender in Log4j 1.2 is vulnerable to deserialization of untrusted data when the attacker has write access to the Log4j configuration. The attacker can provide TopicBindingName and TopicConnectionFactoryBindingName configurations causing JMSAppender to perform JNDI requests that result in remote code execution in a similar fashion to CVE-2021-44228. Note this issue only affects Log4j 1.2 when specifically configured to use JMSAppender, which is not the default. Apache Log4j 1.2 reached end of life in August 2015. Users should upgrade to Log4j 2 as it addresses numerous other issues from the previous versions.(CVE-2021-4104)\r\n\r\nCVE-2020-9493 identified a deserialization issue that was present in Apache Chainsaw. Prior to Chainsaw V2.0 Chainsaw was a component of Apache Log4j 1.2.x where the same issue exists.(CVE-2022-23307)\r\n\r\nJMSSink in all versions of Log4j 1.x is vulnerable to deserialization of untrusted data when the attacker has write access to the Log4j configuration or if the configuration references an LDAP service the attacker has access to. The attacker can provide a TopicConnectionFactoryBindingName configuration causing JMSSink to perform JNDI requests that result in remote code execution in a similar fashion to CVE-2021-4104. Note this issue only affects Log4j 1.x when specifically configured to use JMSSink, which is not the default. Apache Log4j 1.2 reached end of life in August 2015. Users should upgrade to Log4j 2 as it addresses numerous other issues from the previous versions.(CVE-2022-23302)","affected":[{"package":{"name":"log4j12","ecosystem":"openEuler:22.03-LTS","purl":"pkg:rpm/openEuler/log4j12&distro=openEuler-22.03-LTS"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"1.2.17-25.oe2203"}]}],"ecosystem_specific":{"noarch":["log4j12-help-1.2.17-25.oe2203.noarch.rpm","log4j12-1.2.17-25.oe2203.noarch.rpm"],"src":["log4j12-1.2.17-25.oe2203.src.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2022-2065.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/en/security/safety-bulletin/detail.html?id=openEuler-SA-2022-2065"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-4104"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-23307"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2022-23302"}],"database_specific":{"severity":"Critical"}}