{"schema_version":"1.7.3","id":"OESA-2026-1095","published":"2026-01-16T11:59:12Z","modified":"2026-01-16T12:30:17.147617Z","upstream":["CVE-2025-45582"],"summary":"tar security update","details":"GNU Tar provides the ability to create tar archives, as well as various other kinds of manipulation. For example, you can use Tar on previously created archives to extract files, to store additional files, or to update or list files which were already stored.\r\n\r\nSecurity Fix(es):\n\nGNU Tar through 1.35 allows file overwrite via directory traversal in crafted TAR archives, with a certain two-step process. First, the victim must extract an archive that contains a ../ symlink to a critical directory. Second, the victim must extract an archive that contains a critical file, specified via a relative pathname that begins with the symlink name and ends with that critical file&apos;s name. Here, the extraction follows the symlink and overwrites the critical file. This bypasses the protection mechanism of &quot;Member name contains &apos;..&apos;&quot; that would occur for a single TAR archive that attempted to specify the critical file via a ../ approach. For example, the first archive can contain &quot;x -&gt; ../../../../../home/victim/.ssh&quot; and the second archive can contain x/authorized_keys. This can affect server applications that automatically extract any number of user-supplied TAR archives, and were relying on the blocking of traversal. This can also affect software installation processes in which &quot;tar xf&quot; is run more than once (e.g., when installing a package can automatically install two dependencies that are set up as untrusted tarballs instead of official packages). NOTE: the official GNU Tar manual has an otherwise-empty directory for each &quot;tar xf&quot; in its Security Rules of Thumb; however, third-party advice leads users to run &quot;tar xf&quot; more than once into the same directory.(CVE-2025-45582)","affected":[{"package":{"name":"tar","ecosystem":"openEuler:24.03-LTS-SP3","purl":"pkg:rpm/openEuler/tar&distro=openEuler-24.03-LTS-SP3"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"1.35-3.oe2403sp3"}]}],"ecosystem_specific":{"aarch64":["tar-1.35-3.oe2403sp3.aarch64.rpm","tar-debuginfo-1.35-3.oe2403sp3.aarch64.rpm","tar-debugsource-1.35-3.oe2403sp3.aarch64.rpm"],"noarch":["tar-help-1.35-3.oe2403sp3.noarch.rpm"],"src":["tar-1.35-3.oe2403sp3.src.rpm"],"x86_64":["tar-1.35-3.oe2403sp3.x86_64.rpm","tar-debuginfo-1.35-3.oe2403sp3.x86_64.rpm","tar-debugsource-1.35-3.oe2403sp3.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2026-1095.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/zh/security/security-bulletins/detail/?id=openEuler-SA-2026-1095"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-45582"}],"database_specific":{"severity":"Medium"}}