{"schema_version":"1.7.3","id":"OESA-2022-2066","published":"2022-11-11T11:04:33Z","modified":"2025-09-03T06:17:42.567471Z","upstream":["CVE-2021-43859"],"summary":"xstream security update","details":"XStream is a simple library to serialize objects to XML and back again. A high level facade is supplied that simplifies common use cases. Custom objects can be serialized without need for specifying mappings. Speed and low memory footprint are a crucial part of the design,making it suitable for large object graphs or systems with high message throughput. No information is duplicated that can be obtained via reflection. This results in XML that is easier to read for humans and more compact than native Java serialization. XStream serializes internal fields, including private and final. Supports non-public and inner classes. Classes are not required to have default constructor.Duplicate references encountered in the object-model will be maintained. Supports circular references. By implementing an interface, XStream can serialize directly to/from any tree structure (not just XML). Strategies can be registered allowing customization of how particular types are represented as XML. When an exception occurs due to malformed XML, detailed diagnostics are provided to help isolate and fix the problem.\r\n\r\nSecurity Fix(es):\r\n\r\nXStream is an open source java library to serialize objects to XML and back again. Versions prior to 1.4.19 may allow a remote attacker to allocate 100% CPU time on the target system depending on CPU type or parallel execution of such a payload resulting in a denial of service only by manipulating the processed input stream. XStream 1.4.19 monitors and accumulates the time it takes to add elements to collections and throws an exception if a set threshold is exceeded. Users are advised to upgrade as soon as possible. Users unable to upgrade may set the NO_REFERENCE mode to prevent recursion. See GHSA-rmr5-cpv2-vgjf for further details on a workaround if an upgrade is not possible.(CVE-2021-43859)","affected":[{"package":{"name":"xstream","ecosystem":"openEuler:22.03-LTS","purl":"pkg:rpm/openEuler/xstream&distro=openEuler-22.03-LTS"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"1.4.18-2.oe2203"}]}],"ecosystem_specific":{"noarch":["xstream-parent-1.4.18-2.oe2203.noarch.rpm","xstream-javadoc-1.4.18-2.oe2203.noarch.rpm","xstream-benchmark-1.4.18-2.oe2203.noarch.rpm","xstream-hibernate-1.4.18-2.oe2203.noarch.rpm","xstream-1.4.18-2.oe2203.noarch.rpm"],"src":["xstream-1.4.18-2.oe2203.src.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2022-2066.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/en/security/safety-bulletin/detail.html?id=openEuler-SA-2022-2066"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43859"}],"database_specific":{"severity":"High"}}