{"schema_version":"1.7.3","id":"OESA-2022-1929","published":"2022-09-23T11:04:18Z","modified":"2025-09-03T06:17:35.930378Z","upstream":["CVE-2021-39226","CVE-2021-43813"],"summary":"grafana security update","details":"\r\n\r\nSecurity Fix(es):\r\n\r\nGrafana is an open source data visualization platform. In affected versions unauthenticated and authenticated users are able to view the snapshot with the lowest database key by accessing the literal paths: /dashboard/snapshot/:key, or /api/snapshots/:key. If the snapshot &quot;public_mode&quot; configuration setting is set to true (vs default of false), unauthenticated users are able to delete the snapshot with the lowest database key by accessing the literal path: /api/snapshots-delete/:deleteKey. Regardless of the snapshot &quot;public_mode&quot; setting, authenticated users are able to delete the snapshot with the lowest database key by accessing the literal paths: /api/snapshots/:key, or /api/snapshots-delete/:deleteKey. The combination of deletion and viewing enables a complete walk through all snapshot data while resulting in complete snapshot data loss. This issue has been resolved in versions 8.1.6 and 7.5.11. If for some reason you cannot upgrade you can use a reverse proxy or similar to block access to the literal paths: /api/snapshots/:key, /api/snapshots-delete/:deleteKey, /dashboard/snapshot/:key, and /api/snapshots/:key. They have no normal function and can be disabled without side effects.(CVE-2021-39226)\r\n\r\nGrafana is an open-source platform for monitoring and observability. Grafana prior to versions 8.3.2 and 7.5.12 contains a directory traversal vulnerability for fully lowercase or fully uppercase .md files. The vulnerability is limited in scope, and only allows access to files with the extension .md to authenticated users only. Grafana Cloud instances have not been affected by the vulnerability. Users should upgrade to patched versions 8.3.2 or 7.5.12. For users who cannot upgrade, running a reverse proxy in front of Grafana that normalizes the PATH of the request will mitigate the vulnerability. The proxy will have to also be able to handle url encoded paths. Alternatively, for fully lowercase or fully uppercase .md files, users can block /api/plugins/.*/markdown/.* without losing any functionality beyond inlined plugin help text.(CVE-2021-43813)","affected":[{"package":{"name":"grafana","ecosystem":"openEuler:20.03-LTS-SP3","purl":"pkg:rpm/openEuler/grafana&distro=openEuler-20.03-LTS-SP3"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"7.5.15-3.oe1"}]}],"ecosystem_specific":{"aarch64":["grafana-debuginfo-7.5.15-3.oe1.aarch64.rpm","grafana-7.5.15-3.oe1.aarch64.rpm"],"src":["grafana-7.5.15-3.oe1.src.rpm"],"x86_64":["grafana-debuginfo-7.5.15-3.oe1.x86_64.rpm","grafana-7.5.15-3.oe1.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2022-1929.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/en/security/safety-bulletin/detail.html?id=openEuler-SA-2022-1929"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-39226"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2021-43813"}],"database_specific":{"severity":"High"}}