{"schema_version":"1.7.3","id":"OESA-2025-1983","published":"2025-08-08T11:16:46Z","modified":"2025-09-03T06:31:42.746335Z","upstream":["CVE-2025-53905","CVE-2025-53906"],"summary":"vim security update","details":"Vim is an advanced text editor that seeks to provide the power of the de-facto Unix editor &amp;apos;Vi&amp;apos;, with a more complete feature set. Vim is a highly configurable text editor built to enable efficient text editing. It is an improved version of the vi editor distributed with most UNIX systems.\r\n\r\nSecurity Fix(es):\n\nVim is an open source, command line text editor. Prior to version 9.1.1552, a path traversal issue in Vim’s tar.vim plugin can allow overwriting of arbitrary files when opening specially crafted tar archives. Impact is low because this exploit requires direct user interaction. However, successfully exploitation can lead to overwriting sensitive files or placing executable code in privileged locations, depending on the permissions of the process editing the archive. The victim must edit such a file using Vim which will reveal the filename and the file content, a careful user may suspect some strange things going on. Successful exploitation could results in the ability to execute arbitrary commands on the underlying operating system. Version 9.1.1552 contains a patch for the vulnerability.(CVE-2025-53905)\n\nA vulnerability, which was classified as critical, has been found in vim up to 9.1.1550 (Word Processing Software).Using CWE to declare the problem leads to CWE-22. The product uses external input to construct a pathname that is intended to identify a file or directory that is located underneath a restricted parent directory, but the product does not properly neutralize special elements within the pathname that can cause the pathname to resolve to a location that is outside of the restricted directory.Impacted is confidentiality, integrity, and availability.Upgrading to version 9.1.1551 eliminates this vulnerability. Applying the patch 586294a04179d855c3d1d4ee5ea83931963680b8 is able to eliminate this problem. The bugfix is ready for download at github.com. The best possible mitigation is suggested to be upgrading to the latest version.(CVE-2025-53906)","affected":[{"package":{"name":"vim","ecosystem":"openEuler:24.03-LTS-SP1","purl":"pkg:rpm/openEuler/vim&distro=openEuler-24.03-LTS-SP1"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"9.0.2092-20.oe2403sp1"}]}],"ecosystem_specific":{"aarch64":["vim-X11-9.0.2092-20.oe2403sp1.aarch64.rpm","vim-common-9.0.2092-20.oe2403sp1.aarch64.rpm","vim-debuginfo-9.0.2092-20.oe2403sp1.aarch64.rpm","vim-debugsource-9.0.2092-20.oe2403sp1.aarch64.rpm","vim-enhanced-9.0.2092-20.oe2403sp1.aarch64.rpm","vim-minimal-9.0.2092-20.oe2403sp1.aarch64.rpm"],"noarch":["vim-filesystem-9.0.2092-20.oe2403sp1.noarch.rpm"],"src":["vim-9.0.2092-20.oe2403sp1.src.rpm"],"x86_64":["vim-X11-9.0.2092-20.oe2403sp1.x86_64.rpm","vim-common-9.0.2092-20.oe2403sp1.x86_64.rpm","vim-debuginfo-9.0.2092-20.oe2403sp1.x86_64.rpm","vim-debugsource-9.0.2092-20.oe2403sp1.x86_64.rpm","vim-enhanced-9.0.2092-20.oe2403sp1.x86_64.rpm","vim-minimal-9.0.2092-20.oe2403sp1.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2025-1983.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/zh/security/security-bulletins/detail/?id=openEuler-SA-2025-1983"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-53905"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-53906"}],"database_specific":{"severity":"Medium"}}