{"schema_version":"1.7.3","id":"OESA-2025-2297","published":"2025-09-19T13:12:56Z","modified":"2025-09-19T14:02:43.451032Z","upstream":["CVE-2024-11218","CVE-2024-45337","CVE-2024-9341","CVE-2024-9407","CVE-2025-22869","CVE-2025-27144"],"summary":"buildah security update","details":"The  package provides a command line tool which can be used to * create a working container from scratch or * create a working container from an image as a starting point * mount/umount a working container&amp;apos;s root file system for manipulation * save container&amp;apos;s root file system layer to create a new image * delete a working container or an image\r\n\r\nSecurity Fix(es):\n\nA vulnerability was found in `podman build` and `buildah.` This issue occurs in a container breakout by using --jobs=2 and a race condition when building a malicious Containerfile. SELinux might mitigate it, but even with SELinux on, it still allows the enumeration of files and directories on the host.(CVE-2024-11218)\n\nApplications and libraries which misuse connection.serverAuthenticate (via callback field ServerConfig.PublicKeyCallback) may be susceptible to an authorization bypass. The documentation for ServerConfig.PublicKeyCallback says that &quot;A call to this function does not guarantee that the key offered is in fact used to authenticate.&quot; Specifically, the SSH protocol allows clients to inquire about whether a public key is acceptable before proving control of the corresponding private key. PublicKeyCallback may be called with multiple keys, and the order in which the keys were provided cannot be used to infer which key the client successfully authenticated with, if any. Some applications, which store the key(s) passed to PublicKeyCallback (or derived information) and make security relevant determinations based on it once the connection is established, may make incorrect assumptions. For example, an attacker may send public keys A and B, and then authenticate with A. PublicKeyCallback would be called only twice, first with A and then with B. A vulnerable application may then make authorization decisions based on key B for which the attacker does not actually control the private key. Since this API is widely misused, as a partial mitigation golang.org/x/(CVE-2024-45337)\n\nA flaw was found in Go. When FIPS mode is enabled on a system, container runtimes may incorrectly handle certain file paths due to improper validation in the containers/common Go library. This flaw allows an attacker to exploit symbolic links and trick the system into mounting sensitive host directories inside a container. This issue also allows attackers to access critical host files, bypassing the intended isolation between containers and the host system.(CVE-2024-9341)\n\nA vulnerability exists in the bind-propagation option of the Dockerfile RUN --mount instruction. The system does not properly validate the input passed to this option, allowing users to pass arbitrary parameters to the mount instruction. This issue can be exploited to mount sensitive directories from the host into a container during the build process and, in some cases, modify the contents of those mounted files. Even if SELinux is used, this vulnerability can bypass its protection by allowing the source directory to be relabeled to give the container access to host files.(CVE-2024-9407)\n\nSSH servers which implement file transfer protocols are vulnerable to a denial of service attack from clients which complete the key exchange slowly, or not at all, causing pending content to be read into memory, but never transmitted.(CVE-2025-22869)\n\nGo JOSE provides an implementation of the Javascript Object Signing and Encryption set of standards in Go, including support for JSON Web Encryption (JWE), JSON Web Signature (JWS), and JSON Web Token (JWT) standards. In versions on the 4.x branch prior to version 4.0.5, when parsing compact JWS or JWE input, Go JOSE could use excessive memory. The code used strings.Split(token, &quot;.&quot;) to split JWT tokens, which is vulnerable to excessive memory consumption when processing maliciously crafted tokens with a large number of `.` characters.  An attacker could exploit this by sending numerous malformed tokens, leading to memory exhaustion and a Denial of Service. Version 4.0.5 fixes this issue. As a workaround, applications could pre-validate that payloads passed to Go JOSE do not contain an excessive number of `.` characters.(CVE-2025-27144)","affected":[{"package":{"name":"buildah","ecosystem":"openEuler:22.03-LTS-SP4","purl":"pkg:rpm/openEuler/buildah&distro=openEuler-22.03-LTS-SP4"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"1.26.1-7.oe2203sp4"}]}],"ecosystem_specific":{"aarch64":["buildah-1.26.1-7.oe2203sp4.aarch64.rpm","buildah-debuginfo-1.26.1-7.oe2203sp4.aarch64.rpm","buildah-debugsource-1.26.1-7.oe2203sp4.aarch64.rpm"],"src":["buildah-1.26.1-7.oe2203sp4.src.rpm"],"x86_64":["buildah-1.26.1-7.oe2203sp4.x86_64.rpm","buildah-debuginfo-1.26.1-7.oe2203sp4.x86_64.rpm","buildah-debugsource-1.26.1-7.oe2203sp4.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2025-2297.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/zh/security/security-bulletins/detail/?id=openEuler-SA-2025-2297"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2024-11218"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2024-45337"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2024-9341"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2024-9407"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-22869"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2025-27144"}],"database_specific":{"severity":"Critical"}}