{"schema_version":"1.7.3","id":"OESA-2025-1222","published":"2025-02-28T15:34:40Z","modified":"2025-09-03T06:18:59.655262Z","upstream":["CVE-2023-24534","CVE-2023-24536","CVE-2023-24537","CVE-2024-45336","CVE-2024-45341"],"summary":"golang security update","details":".\r\n\r\nSecurity Fix(es):\n\nHTTP and MIME header parsing can allocate large amounts of memory, even when parsing small inputs, potentially leading to a denial of service. Certain unusual patterns of input data can cause the common function used to parse HTTP and MIME headers to allocate substantially more memory than required to hold the parsed headers. An attacker can exploit this behavior to cause an HTTP server to allocate large amounts of memory from a small request, potentially leading to memory exhaustion and a denial of service. With fix, header parsing now correctly allocates only the memory required to hold parsed headers..(CVE-2023-24534)\n\nMultipart form parsing can consume large amounts of CPU and memory when processing form inputs containing very large numbers of parts. This stems from several causes: 1. mime/multipart.Reader.ReadForm limits the total memory a parsed multipart form can consume. ReadForm can undercount the amount of memory consumed, leading it to accept larger inputs than intended. 2. Limiting total memory does not account for increased pressure on the garbage collector from large numbers of small allocations in forms with many parts. 3. ReadForm can allocate a large number of short-lived buffers, further increasing pressure on the garbage collector. The combination of these factors can permit an attacker to cause an program that parses multipart forms to consume large amounts of CPU and memory, potentially resulting in a denial of service. This affects programs that use mime/multipart.Reader.ReadForm, as well as form parsing in the net/http package with the Request methods FormFile, FormValue, ParseMultipartForm, and PostFormValue. With fix, ReadForm now does a better job of estimating the memory consumption of parsed forms, and performs many fewer short-lived allocations. In addition, the fixed mime/multipart.Reader imposes the following limits on the size of parsed forms: 1. Forms parsed with ReadForm may contain no more than 1000 parts. This limit may be adjusted with the environment variable GODEBUG=multipartmaxparts=. 2. Form parts parsed with NextPart and NextRawPart may contain no more than 10,000 header fields. In addition, forms parsed with ReadForm may contain no more than 10,000 header fields across all parts. This limit may be adjusted with the environment variable GODEBUG=multipartmaxheaders=..(CVE-2023-24536)\n\nCalling any of the Parse functions on Go source code which contains //line directives with very large line numbers can cause an infinite loop due to integer overflow..(CVE-2023-24537)\n\nThe HTTP client drops sensitive headers after following a cross-domain redirect. For example, a request to a.com/ containing an Authorization header which is redirected to b.com/ will not send that header to b.com. In the event that the client received a subsequent same-domain redirect, however, the sensitive headers would be restored. For example, a chain of redirects from a.com/, to b.com/1, and finally to b.com/2 would incorrectly send the Authorization header to b.com/2.(CVE-2024-45336)\n\nA certificate with a URI which has a IPv6 address with a zone ID may incorrectly satisfy a URI name constraint that applies to the certificate chain. Certificates containing URIs are not permitted in the web PKI, so this only affects users of private PKIs which make use of URIs.(CVE-2024-45341)","affected":[{"package":{"name":"golang","ecosystem":"openEuler:22.03-LTS-SP3","purl":"pkg:rpm/openEuler/golang&distro=openEuler-22.03-LTS-SP3"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"1.17.3-38.oe2203sp3"}]}],"ecosystem_specific":{"aarch64":["golang-1.17.3-38.oe2203sp3.aarch64.rpm"],"noarch":["golang-devel-1.17.3-38.oe2203sp3.noarch.rpm","golang-help-1.17.3-38.oe2203sp3.noarch.rpm"],"src":["golang-1.17.3-38.oe2203sp3.src.rpm"],"x86_64":["golang-1.17.3-38.oe2203sp3.x86_64.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2025-1222.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/zh/security/security-bulletins/detail/?id=openEuler-SA-2025-1222"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-24534"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-24536"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2023-24537"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2024-45336"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2024-45341"}],"database_specific":{"severity":"High"}}