{
  "affected": [
    {
      "database_specific": {
        "source": "https://repo.openeuler.org/security/data/osv/OESA-2021-1208.json"
      },
      "ecosystem_specific": {
        "noarch": [
          "xstream-javadoc-1.4.17-1.oe1.noarch.rpm",
          "xstream-hibernate-1.4.17-1.oe1.noarch.rpm",
          "xstream-parent-1.4.17-1.oe1.noarch.rpm",
          "xstream-benchmark-1.4.17-1.oe1.noarch.rpm",
          "xstream-1.4.17-1.oe1.noarch.rpm"
        ],
        "src": [
          "xstream-1.4.17-1.oe1.src.rpm"
        ]
      },
      "package": {
        "ecosystem": "openEuler:20.03-LTS-SP1",
        "name": "xstream",
        "purl": "pkg:rpm/openEuler/xstream&distro=openEuler-20.03-LTS-SP1"
      },
      "ranges": [
        {
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "1.4.17-1.oe1"
            }
          ],
          "type": "ECOSYSTEM"
        }
      ],
      "versions": []
    }
  ],
  "database_specific": {
    "severity": "High"
  },
  "details": "XStream is a simple library to serialize objects to XML and back again. A high level facade is supplied that simplifies common use cases. Custom objects can be serialized without need for specifying mappings. Speed and low memory footprint are a crucial part of the design, making it suitable for large object graphs or systems with high message throughput. No information is duplicated that can be obtained via reflection. This results in XML that is easier to read for humans and more compact than native Java serialization. XStream serializes internal fields, including private and final. Supports non-public and inner classes. Classes are not required to have default constructor. Duplicate references encountered in the object-model will be maintained. Supports circular references. By implementing an interface, XStream can serialize directly to/from any tree structure (not just XML). Strategies can be registered allowing customization of how particular types are represented as XML. When an exception occurs due to malformed XML, detailed diagnostics are provided to help isolate and fix the problem.\r\n\r\nSecurity Fix(es):\r\n\r\nThe processed stream at unmarshalling time contains type information to recreate the formerly written objects. XStream creates therefore new instances based on these type information. An attacker can manipulate the processed input stream and replace or inject objects, that result in execution of a local command on the server.(CVE-2021-29505)",
  "id": "OESA-2021-1208",
  "modified": "2025-09-03T06:17:22.463008Z",
  "published": "2021-06-07T11:02:56Z",
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://openeuler.org/en/security/safety-bulletin/detail.html?id=openEuler-SA-2021-1208"
    },
    {
      "type": "ADVISORY",
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2021-29505"
    }
  ],
  "schema_version": "1.7.3",
  "summary": "xstream security update",
  "upstream": [
    "CVE-2021-29505"
  ]
}