{
  "affected": [
    {
      "database_specific": {
        "source": "https://repo.openeuler.org/security/data/osv/OESA-2025-2140.json"
      },
      "ecosystem_specific": {
        "aarch64": [
          "libpq-15.14-1.oe2403sp2.aarch64.rpm",
          "libpq-debuginfo-15.14-1.oe2403sp2.aarch64.rpm",
          "libpq-debugsource-15.14-1.oe2403sp2.aarch64.rpm",
          "libpq-devel-15.14-1.oe2403sp2.aarch64.rpm"
        ],
        "src": [
          "libpq-15.14-1.oe2403sp2.src.rpm"
        ],
        "x86_64": [
          "libpq-15.14-1.oe2403sp2.x86_64.rpm",
          "libpq-debuginfo-15.14-1.oe2403sp2.x86_64.rpm",
          "libpq-debugsource-15.14-1.oe2403sp2.x86_64.rpm",
          "libpq-devel-15.14-1.oe2403sp2.x86_64.rpm"
        ]
      },
      "package": {
        "ecosystem": "openEuler:24.03-LTS-SP2",
        "name": "libpq",
        "purl": "pkg:rpm/openEuler/libpq&distro=openEuler-24.03-LTS-SP2"
      },
      "ranges": [
        {
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "15.14-1.oe2403sp2"
            }
          ],
          "type": "ECOSYSTEM"
        }
      ],
      "versions": []
    }
  ],
  "database_specific": {
    "severity": "High"
  },
  "details": "PostgreSQL is a powerful, open source object-relational database system that uses and extends the SQL language combined with many features that safely store and scale the most complicated data workloads. This package provides the essential shared library for any PostgreSQL client program or interface.\r\n\r\nSecurity Fix(es):\n\nPostgreSQL optimizer statistics allow a user to read sampled data within a view that the user cannot access.  Separately, statistics allow a user to read sampled data that a row security policy intended to hide.  PostgreSQL maintains statistics for tables by sampling data available in columns; this data is consulted during the query planning process.  Prior to this release, a user could craft a leaky operator that bypassed view access control lists (ACLs) and bypassed row security policies in partitioning or table inheritance hierarchies.  Reachable statistics data notably included histograms and most-common-values lists.  CVE-2017-7484 and CVE-2019-10130 intended to close this class of vulnerability, but this gap remained.  Versions before PostgreSQL 17.6, 16.10, 15.14, 14.19, and 13.22 are affected.(CVE-2025-8713)\n\nUntrusted data inclusion in pg_dump in PostgreSQL allows a malicious superuser of the origin server to inject arbitrary code for restore-time execution as the client operating system account running psql to restore the dump, via psql meta-commands.  pg_dumpall is also affected.  pg_restore is affected when used to generate a plain-format dump.  This is similar to MySQL CVE-2024-21096.  Versions before PostgreSQL 17.6, 16.10, 15.14, 14.19, and 13.22 are affected.(CVE-2025-8714)\n\nImproper neutralization of newlines in pg_dump in PostgreSQL allows a user of the origin server to inject arbitrary code for restore-time execution as the client operating system account running psql to restore the dump, via psql meta-commands inside a purpose-crafted object name.  The same attacks can achieve SQL injection as a superuser of the restore target server.  pg_dumpall, pg_restore, and pg_upgrade are also affected.  Versions before PostgreSQL 17.6, 16.10, 15.14, 14.19, and 13.22 are affected.  Versions before 11.20 are unaffected.  CVE-2012-0868 had fixed this class of problem, but version 11.20 reintroduced it.(CVE-2025-8715)",
  "id": "OESA-2025-2140",
  "modified": "2025-09-05T13:18:08.120536Z",
  "published": "2025-09-05T12:42:31Z",
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://www.openeuler.org/zh/security/security-bulletins/detail/?id=openEuler-SA-2025-2140"
    },
    {
      "type": "ADVISORY",
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2025-8713"
    },
    {
      "type": "ADVISORY",
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2025-8714"
    },
    {
      "type": "ADVISORY",
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2025-8715"
    }
  ],
  "schema_version": "1.7.3",
  "summary": "libpq security update",
  "upstream": [
    "CVE-2025-8713",
    "CVE-2025-8714",
    "CVE-2025-8715"
  ]
}