{"schema_version":"1.7.3","id":"OESA-2024-1899","published":"2024-07-26T11:08:37Z","modified":"2025-09-03T06:20:06.794269Z","upstream":["CVE-2024-25638"],"summary":"dnsjava security update","details":"dnsjava is an implementation of DNS in Java. It supports all of the common record types and the DNSSEC types. It can be used for queries, zone transfers, and dynamic updates. It includes a cache which can be used by clients, and a minimal implementation of a server. It supports TSIG authenticated messages, partial DNSSEC verification, and EDNS0. dnsjava provides functionality above and beyond that of the InetAddress class. Since it is written in pure Java, dnsjava is fully threadable, and in many cases is faster than using InetAddress. dnsjava provides both high and low level access to DNS. The high level functions perform queries for records of a given name, type, and class, and return an array of records. There is also a clone of InetAddress, which is even simpler. A cache is used to reduce the number of DNS queries sent. The low level functions allow direct manipulation of dns messages and records, as well as allowing additional resolver properties to be set. A &apos;dig&apos; clone and a dynamic update program are included, as well as a primary-only server.\r\n\r\nSecurity Fix(es):\r\n\r\ndnsjava is an implementation of DNS in Java. Records in DNS replies are not checked for their relevance to the query, allowing an attacker to respond with RRs from different zones. This vulnerability is fixed in 3.6.0.(CVE-2024-25638)","affected":[{"package":{"name":"dnsjava","ecosystem":"openEuler:24.03-LTS","purl":"pkg:rpm/openEuler/dnsjava&distro=openEuler-24.03-LTS"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"3.5.3-2.oe2403"}]}],"ecosystem_specific":{"noarch":["dnsjava-3.5.3-2.oe2403.noarch.rpm","dnsjava-javadoc-3.5.3-2.oe2403.noarch.rpm"],"src":["dnsjava-3.5.3-2.oe2403.src.rpm"]},"database_specific":{"source":"https://repo.openeuler.org/security/data/osv/OESA-2024-1899.json"}}],"references":[{"type":"ADVISORY","url":"https://www.openeuler.org/zh/security/security-bulletins/detail/?id=openEuler-SA-2024-1899"},{"type":"ADVISORY","url":"https://nvd.nist.gov/vuln/detail/CVE-2024-25638"}],"database_specific":{"severity":"High"}}