{"schema_version":"1.7.3","id":"RLSA-2025:11401","published":"2025-10-03T19:56:45.270310Z","modified":"2025-10-08T17:12:46.085355Z","upstream":["CVE-2025-27151","CVE-2025-32023","CVE-2025-48367"],"summary":"Important: valkey security update","details":"Valkey is an advanced key-value store. It is often referred to as a data structure server since keys can contain strings, hashes, lists, sets and sorted sets.  You can run atomic operations on these types, like appending to a string; incrementing the value in a hash; pushing to a list; computing set intersection, union and difference; or getting the member with highest ranking in a sorted set.  In order to achieve its outstanding performance, Valkey works with an in-memory dataset. Depending on your use case, you can persist it either by dumping the dataset to disk every once in a while, or by appending each command to a log.  Valkey also supports trivial-to-setup master-slave replication, with very fast non-blocking first synchronization, auto-reconnection on net split and so forth.  Other features include Transactions, Pub/Sub, Lua scripting, Keys with a limited time-to-live, and configuration settings to make Valkey behave like a cache.  You can use Valkey from most programming languages also.\n\nSecurity Fix(es):\n\n* redis: Redis Stack Buffer Overflow (CVE-2025-27151)\n\n* redis: Redis Unauthenticated Denial of Service (CVE-2025-48367)\n\n* redis: Redis Hyperloglog Out-of-Bounds Write Vulnerability (CVE-2025-32023)\n\nFor more details about the security issue(s), including the impact, a CVSS score, acknowledgments, and other related information, refer to the CVE page(s) listed in the References section.","affected":[{"package":{"name":"valkey","ecosystem":"Rocky Linux:10","purl":"pkg:rpm/rocky-linux/valkey?distro=rocky-linux-10-0&epoch=0"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"0"},{"fixed":"0:8.0.4-1.el10_0"}]}],"database_specific":{"source":"https://storage.googleapis.com/resf-osv-data/RLSA-2025:11401.json"}}],"references":[{"type":"ADVISORY","url":"https://errata.rockylinux.org/RLSA-2025:11401"},{"type":"REPORT","url":"https://bugzilla.redhat.com/show_bug.cgi?id=2369153"},{"type":"REPORT","url":"https://bugzilla.redhat.com/show_bug.cgi?id=2376857"},{"type":"REPORT","url":"https://bugzilla.redhat.com/show_bug.cgi?id=2376858"}],"severity":[{"type":"CVSS_V3","score":"CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H"}],"credits":[{"name":"Rocky Enterprise Software Foundation"},{"name":"Red Hat"}]}